{"path":"home/knowledge/work","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/knowledge/work","name":"Work","parent":"home/knowledge","contents":"<h2 id=\"what-do-you-work-on-\">What do you work on?</h2>\n<p>You should work on, first and foremost, difficult challenges.</p>\n<p>Don&#39;t care too much about prestige:</p>\n<blockquote>\n<p>Prestige is just fossilized inspiration. If you do anything well enough, you&#39;ll make it prestigious. Plenty of things we now consider prestigious were anything but at first. Jazz comes to mind—though almost any established art form would do. So just do what you like, and let prestige take care of itself. - <a href=\"http://www.paulgraham.com/love.html\">Paul Graham</a></p>\n</blockquote>\n<h2 id=\"how-do-you-work-\">How do you work?</h2>\n<p>In my experience, work is easiest and most productive when you&#39;re interested in a problem. This makes todo lists hard to follow, since you&#39;ll see a list of complicated tasks rather than interesting problems to solve. One way you could combat that is by reading a task and thinking about the vision behind it - consider the intricacies, purpose, and meaning.</p>\n","folder":3},"children_notes":[{"path":"home/knowledge/work/howIWork","name":"How I Work","parent":"home/knowledge/work","contents":"<p>I&#39;m intrinsically motivated. Work flows into my day, and I usually mildly enjoy whatever I do. I generally don&#39;t schedule for anything to happen, and do whatever holds my interest in the moment.</p>\n<h2 id=\"destroying-interest\">Destroying interest</h2>\n<p>This is a delicate process. Intrinsic motivation and interest can be crushed with sufficient pressure, even if temporarily. If money or assignments or any other extrinsic factors weigh too heavily, it&#39;s going to be way less fun and way harder to do any work.</p>\n<h2 id=\"building-interest\">Building interest</h2>\n<p>A key take-away is that if I want to start doing more work in an area, I have to get emotionally invested, interested and curious. Sheer willpower has not worked in my past experience.</p>\n<p>This also means that it&#39;s hard to force myself to do anything I don&#39;t enjoy. This should probably factor into what I choose as a job.</p>\n","folder":0},{"path":"home/knowledge/work/jobs","name":"Jobs","parent":"home/knowledge/work","contents":"<h2 id=\"self-employment\">Self employment</h2>\n<p>You can probably capture more of the value you produce if there aren&#39;t many levels of hierachy taking a progressively larger cut. Problems are also probably more interesting when you choose to work on them yourself, without the requirement of being backed by a larger organisation.</p>\n<h2 id=\"workplace\">Workplace</h2>\n<p>However, this might not be the full picture. Jobs in an organisation have stability, and if the place you work at is sufficiently small I suspect you&#39;ll still be able to work on things that are fun, exciting and meaningful.</p>\n","folder":0},{"path":"home/knowledge/work/routines","name":"Routines","parent":"home/knowledge/work","contents":"<p>If you&#39;re diagnosing a problem in yourself, it&#39;s better to take a step back and consider your behaviour from a distant point of view.</p>\n<h2 id=\"diagnosing-problems\">Diagnosing Problems</h2>\n<p>Imagine you have a problem with leaving behind dishes after you eat. Every time you see those dishes, you make a mental note that you&#39;ll have to clean them soon. You beat yourself up for it slightly, and hope that this helps you change.</p>\n<p>It doesn&#39;t, because you&#39;re not improving the routine. Your time would be better spent in this scenario if you were to think of ways to make cleaning happen automatically as you go throughout your day: make cleaning dishes your hobby, habitually do it after eating, or always clean something whenever you pass by. This would instead ensure you spend your effort and willpower once, and then your dishes will clean themselves almost automatically for the rest of your life.</p>\n<h2 id=\"routines\">Routines</h2>\n<p>Almost everything in your life is a result of a routine. Any changes you make to your routines can have the potential to yield benefits for the rest of your life.</p>\n<p>Coding is also a routine. Instead of making a note that you should refactor or write cleaner code, you should make it a regular part of the process to fix things you find. That means that almost automatically, your projects will have cleaner code.</p>\n","folder":0}]}}
