{"path":"home/resources","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/resources","name":"Resources","parent":"home","contents":"<h1 id=\"base-philosophy\">Base philosophy</h1>\n<p>Resources, like time and money, are scarce. A lot of what we do is finding different ways to transform, manage, and control these resources.</p>\n<h2 id=\"goals\">Goals</h2>\n<p>Resources like time and money don&#39;t matter to us unless we can redirect them to fill our values. It follows that the best way to manage these resources is to ensure we&#39;ve used them to fulfill our values as best as we could.</p>\n<p>For example, imagine you&#39;re a millionare who can&#39;t take time off. The value of you having money, which fulfills your ego, could be less than the value of having free time, enjoying your life, and living out your days. The best move would then be to quit and slowly spend your money while you&#39;re still alive.</p>\n<p>This presents interesting challenges in our lives. It can sometimes be a perplexing juggling act trying to figure out which scenario makes your life more valuable. What we know for sure is that making any attempt to make an informed choice is probably better than being completely ignorant, so just by keeping your values in mind, you&#39;ll probably get a very good outcome regardless.</p>\n","folder":5},"children_notes":[{"path":"home/resources/money","name":"Money","parent":"home/resources","contents":"<p>I suspect most people have no idea what to do with money. I&#39;m not sure what to do with it, either, except spend it the best way you know how: through large, future-oriented investments.</p>\n<p>I imagine you don&#39;t need a lot of money to be happy, but depending on the type of environment you&#39;re in, you could need a lot of money to shape it into something that&#39;s a pleasure to live in. This could mean removing stressors, relocating, eating well, and having spare time.</p>\n","folder":0},{"path":"home/resources/time","name":"Time","parent":"home/resources","contents":"<p>Lunchtime is the best time.</p>\n","folder":0},{"path":"home/resources/health","name":"Health","parent":"home/resources","contents":"<p>Health is the foundation upon which you build the rest of your work. If you&#39;re in poor health, it gets harder and harder to do the things you&#39;d like to. And if you&#39;re in good shape, that means you have more energy to do demanding work.</p>\n","folder":2}]}}
