{"path":"home/plans/reviews/2019JanGoals","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/plans/reviews/2019JanGoals","name":"2019 Jan Goals","parent":"home/plans/reviews","contents":"<p>For 2019, I&#39;ve created a set of goals to guide me through the year.</p>\n<p>This is a report on how well I&#39;ve been progressing towards these goals.</p>\n<h1 id=\"explore\">Explore</h1>\n<p>What does exploration mean? Exploration can mean finding new books, new hobbies, new people, and new ideas. For others, it can also mean new experiences, a new feeling, a stronger emotion, a taste of the invigorating feeling of pushing the frontier.</p>\n<p>In January, I was too focused on my work, using the tools I know already and pushing for deadlines the hardest I can. I didn&#39;t have as many new experiences as I liked, and in hindsight, I can see that a lot of the experiences I did have are getting stale.</p>\n<p><strong>Next:</strong> There is a lot of room for growth. In February, I want to dedicate more time to taking off days and contemplating the direction I&#39;m taking. I want to understand how other people live their lives so that I can be inspired and take bits and pieces of their routines and call them my own. Things like reading and watching biographies, introducing variety into the writing and content I consume, and talking face to face to interesting people and asking more questions about their life to map the territory in front me. All of these can help make February a better month.</p>\n<h1 id=\"connect\">Connect</h1>\n<p>Humans are primarily social animals. We live, talk, and breathe in packs. That&#39;s why it&#39;s important to prioritize connection with other people.</p>\n<p>I went to a couple of parties, and had a couple of drinks with cool people. I&#39;m getting more comfortable with socializing in college when I get the opportunity.</p>\n<p>Over the past months, I&#39;ve also been getting more confident and more self-expressive. This is a good thing, but I&#39;m probably not the one to credit myself for this. This is more influenced by my environment and peers.</p>\n<p>The breadth of people I interact with on a routine basis has still remained small. I need to widen the amount of people I talk with on communication platforms and in regular conversation, rather than just being friendly whenever we meet on campus.</p>\n<p>I&#39;m still tripping up on not remembering names well - I&#39;m planning to start relying more on the Facebook friends feature. It&#39;s important to keep my distance from the Facebook platform while still utilizing the ability to search for people through connections.</p>\n<p><strong>Next:</strong> To summarize, in February, I&#39;ll need to work on getting to become good friends with people in my class, rather than passing friendly acquaintances. I&#39;ll also start using Facebook to remember names more and explore connections</p>\n<h1 id=\"prioritize\">Prioritize</h1>\n<p>I did a lot of work on projects I like, which this month have been Tutorello and Dyslexi. I managed to keep a good balance of breaks and work, and have kept from being seriously burned out this month, which is a great benefit. I still love my work as much as I did at the beginning, even after going through a great volume of it.</p>\n<p>In general, I want to focus on doing even higher quality work and taking more time off to find perspective. That could mean leaving the small bits and pieces out, and focusing far more on the 20% of the work that creates the 80% of the impact.</p>\n<p>All my projects look to be ending half-way through this month, meaning that I&#39;ll have suddenly have more time as the deadlines pass. I want to make sure I consider the next projects I take on well, as I&#39;ve realized now how large of a time and mind commitment projects really are.</p>\n<p><strong>Next:</strong> Do higher quality work, and deeply consider commiting to projects.</p>\n","folder":0},"children_notes":[]}}
