{"path":"home/strategySeries/reviews/january/exercise","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/strategySeries/reviews/january/exercise","name":"Exercise","parent":"home/strategySeries/reviews/january","contents":"<p>Starting November 26th 2018, I was on the Linear Progression variant of the GZCLP method.</p>\n<h2 id=\"progress\">Progress</h2>\n<p>I&#39;m only measuring Tier 1 exercises. Each exercise has 5 sets. This table compares what my weights were at the beginning of the program to now. The reps and weight are listed in the table, as well as how many reps I managed in the last set, which is an AMRAP set.</p>\n<p>Format - <code>Sets x Reps (kg) - AMRAP Sets</code></p>\n<table>\n<thead>\n<tr>\n<th>Workout</th>\n<th>Nov 26 2018</th>\n<th>jan 22 2019</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Squat</td>\n<td>3 x 50 - AMRAP 3</td>\n<td>3 x 65 - AMRAP 6</td>\n</tr>\n<tr>\n<td>Overhead Press</td>\n<td>3 x 30 - AMRAP 3</td>\n<td>3 x 33.75 - AMRAP 2</td>\n</tr>\n<tr>\n<td>Bench Press</td>\n<td>3 x 35 - AMRAP 3</td>\n<td>3 x 42.5 - AMRAP 6</td>\n</tr>\n<tr>\n<td>Deadlift</td>\n<td>3 x 50 - AMRAP 5</td>\n<td>3 x 65 - AMRAP 8</td>\n</tr>\n</tbody>\n</table>\n<p>I haven&#39;t failed at any Tier 1 exercises except the Overhead Press, which was probably contributed to by a lack of micro plates at my gym. (Do gyms seriously have 0.625kg plates?)</p>\n<h2 id=\"compliance\">Compliance</h2>\n<p>Over a period of 57 days, I finished four sets of these four exercises, meaning 16 days of exercise.</p>\n<p>8 weeks of time passed, and I did an equivalent of 5 weeks of exercise, resulting in 66% of potential sessions attended. I missed 1 week because of Christmas.</p>\n<h2 id=\"results\">Results</h2>\n<p>66% of potential sessions attended isn&#39;t too bad, considering it&#39;s bumped up to 75% when excluding Christmas. I should bump it up to 80%, which still allows for off days when something important comes up. </p>\n<p>I seem to be keeping up with the plan, which is a pleasant surprise.</p>\n<p>I might want to look into changing my gym, to somewhere without a pool, or that many machines.</p>\n","folder":0},"children_notes":[]}}
