{"path":"home/blog/gettingBetterAtChoosingWhatToRead","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/blog/gettingBetterAtChoosingWhatToRead","name":"Getting Better At Choosing What To Read","parent":"home/blog","background":".png","order":1,"contents":"<p>In our lives, we consume content all the time. By content, I mean anything that&#39;s written, spoken, or shown. It&#39;s quite a no-brainer -- not many people exist that have never seen anything written or heard anything spoken -- but it gives us an interesting question. Can we, and should we, optimise the content we consume?</p>\n<p>First, some context. Humanity, for a long time, didn&#39;t have nearly as much information as we have access to now. Back in the primordial savannah, all you could get was stories from your tribe members about whatever current danger there was lurking about in the dark. If you were in a particularly advanced tribe, you could even pass on stories to your kids, forming a simple sort of culture where tales are passed on and knowledge is somewhat retained.</p>\n<p>Suffice to say, the situation has changed. It changed a lot when someone thought of a cool idea of a machine that writes books, and then it changed really sharply when someone thought of the Internet. I&#39;m not even going to bother throwing numbers at you that neither you nor I can even comprehend the scale of, but let&#39;s leave it at this: there is far more information now than there ever was.</p>\n<p>We are at the awkward teenager years of humanity where the rate at which we can consume information is super slow, and so, we have a desperate need for curation. And the real kicker is that since this is first time we&#39;ve experienced such a massive amount of information with such high availability, any intuitions about how to curate this information fall far short. </p>\n<h2 id=\"refining-curation\">Refining curation</h2>\n<p>Of course, to fix these problems fully would require radically reconstructing our brains. But even with our current limited hardware, I bet we can adapt.</p>\n<p>If we&#39;re looking for a personal advantage in curation, we can settle just for refining our personal methodologies. Since the world is somewhat competitive, and knowledge compounds like interest does, becoming slightly more effective at this task will yield large returns later on in life.</p>\n<p>How, in particular, we curate is a question that will determine much of our lives, and so is something that can&#39;t be totally addressed in a blog post. But I can give a first stab at an answer to this question that takes in a couple of assumptions. </p>\n<p>First, it assumes you&#39;re pretty early on in the learning process. You&#39;re still in education, or you just finished education, and you want a handle on the deep fundamentals more than you&#39;d want to grasp superficial technicalities. Depending on your world perspective, you could say you never really finish education, so this assumption could hold true forever.</p>\n<p>Second, it assumes that what you wanted to learn about does not change fast. This is correlated to how new the field is. This doesn&#39;t work at all for computer programming. It works slightly better but still pretty poorly for general computer science. If you get more broad, it works pretty well for mathematics. And for basic human behaviour, which did not change much over the past few millenia, it works perfectly. </p>\n<h3 id=\"1-consume-mostly-longform-content\">1. Consume mostly longform content</h3>\n<p>This means you should basically mostly read.</p>\n<p>Though the allure of bite-sized snippets of information is charming, the simple truth is that we need to engage with what we&#39;re reading in order to get anything at all out of it. It&#39;s not enough to read a book summary. Quite often, it&#39;s not even enough to read a book.</p>\n<p>Learning requires engagement and struggle. If what you&#39;re reading is easy, you&#39;re not improving. Durable knowledge is forged through frustrations, through feeling like you&#39;re stuck, and being regularly confused.</p>\n<h3 id=\"2-read-old-books\">2. Read old books</h3>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Lindy_effect\">Lindy effect</a> is the theory that if you see a book today, and it was written a long time ago, the chances are that it&#39;s quite good. A book survives proportional to it&#39;s value, where disappointing books die off quite quickly and great ones impact the culture for a long time. If a book exists today, and it is quite old, you can expect that it has some great ideas or stories that kept the book alive.</p>\n<h3 id=\"3-read-diversely\">3. Read diversely</h3>\n<p>Just like a good training routine gives you a few core movements that cover a wide range of muscles, you should read books that cover a wide range of topics, at least at the beginning. If you skip building a strong general foundation, you&#39;ll seem to progress faster but you&#39;ll stumble later on.</p>\n<p>This is especially true in a world which changes very fast. Being too specialized may seem productive, but just like a training routine which targets only one muscle, you&#39;ll die off whenever the world changes next, which will probably be sooner than you think. And at that point, your specialisation will be useless whenever the next big disruption plunges you into a world you don&#39;t even know the basics of.</p>\n","folder":0},"children_notes":[]}}
