{"path":"home/resources/health/nutrition","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/resources/health/nutrition","name":"Nutrition","parent":"home/resources/health","contents":"<p>I try to replace as much of my diet as is convenient with Huel, which is a powdered food replacement.</p>\n<table>\n<thead>\n<tr>\n<th>Nutritional attributes</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Flavour</td>\n<td>Huel Vanilla</td>\n</tr>\n<tr>\n<td>Calories per gram</td>\n<td>4kcal</td>\n</tr>\n<tr>\n<td>Calories per serving</td>\n<td>760kcal</td>\n</tr>\n<tr>\n<td>Calorie daily target</td>\n<td>3000kcal</td>\n</tr>\n</tbody>\n</table>\n<table>\n<thead>\n<tr>\n<th>Quantities</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>60g</td>\n<td>240kcal - 1/12</td>\n</tr>\n<tr>\n<td>90g</td>\n<td>360kcal - 1/8</td>\n</tr>\n<tr>\n<td>120g</td>\n<td>480kcal - 1/6</td>\n</tr>\n<tr>\n<td>150g</td>\n<td>600kcal - 1/5</td>\n</tr>\n<tr>\n<td>190g</td>\n<td>760kcal - 1/4</td>\n</tr>\n</tbody>\n</table>\n<p>Sometimes you can feel discomfort, which I think might be due to either:</p>\n<ul>\n<li>Too many calories per serving</li>\n<li>Too much Huel consumption</li>\n<li>Eating Huel and closely after eating normal food</li>\n</ul>\n<p>Powdered food offers a significant benefit on time savings and nutritional content. Huel usually accomodates for 50% of my calorie intake.</p>\n<h2 id=\"other-food\">Other food</h2>\n<h3 id=\"against-sugar\">Against Sugar</h3>\n<blockquote>\n<p>Eating lots of sugar is the thing that makes me feel the worst and that I try hardest to avoid.  I also try to avoid foods that aggravate my digestion or spike up inflammation (for example, very spicy foods).  I don’t have much willpower when it comes to sweet things, so I mostly just try to keep junk food out of the house. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<p>Sugary food does not work for me on any scale. Some people suggest cutting down on the sugary food you eat. I don&#39;t think this works well.</p>\n<p>I don&#39;t really enjoy sugary food, but if I have it around, I&#39;ll instintinctively grab more on autopilot. I almost always feel worse after I eat any volume of it. I think I should figure out how to get rid of it entirely, and replace it with snacks that are less intensely sugary.</p>\n<p>Sugary food is extremely widely available. If I were to cut it down by a meaningfully large percentage, the most likely solution would be to tackle my habits in getting food - shop at different places, or preprepare food, or pick snacks that aren&#39;t as sugary.</p>\n<h3 id=\"eating-for-pleasure\">Eating for Pleasure</h3>\n<p>By cutting down on the amount of meals I&#39;m forced to make, I can enjoy the meals I choose to make.</p>\n<p>I&#39;ve started eating more fruit, and significantly cut down on the meat I eat on average.</p>\n","folder":0},"children_notes":[]}}
