{"path":"home/knowledge","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/knowledge","name":"Knowledge","parent":"home","contents":"","folder":15},"children_notes":[{"path":"home/knowledge/jobs","name":"Jobs","parent":"home/knowledge","contents":"<h2 id=\"self-employment\">Self employment</h2>\n<p>You can probably capture more of the value you produce if there aren&#39;t many levels of hierachy taking a progressively larger cut. Problems are also probably more interesting when you choose to work on them yourself, without the requirement of being backed by a larger organisation.</p>\n<h2 id=\"workplace\">Workplace</h2>\n<p>However, this might not be the full picture. Jobs in an organisation have stability, and if the place you work at is sufficiently small I suspect you&#39;ll still be able to work on things that are fun, exciting and meaningful.</p>\n","folder":0},{"path":"home/knowledge/mu","name":"Mu","parent":"home/knowledge","contents":"<p>Mu, a Korean and Japanese term, is a word we do not have an adequate parallel for in the English language.</p>\n<p>It means &quot;no thing&quot;. For example, imagine a computer to have either ones or zeroes. You turn the computer off and ask does it contain a one or zero. The answer to the question is Mu.</p>\n<p>Mu is an answer which suggests that the question does not make sense to ask when considering reality. We are conditioned to think that every question has an answer, while offering Mu as a response signifies defeat. This is incorrect. It&#39;s vital to understand that not every question should be asked, and inherent in the question may be significant flaws.</p>\n<p>The closest parallel to Mu in English is <em>n/a</em>.</p>\n<p>Mu is used to indicate a question whose &quot;answer&quot; is to:</p>\n<ul>\n<li>un-ask the question,</li>\n<li>indicate the question is fundamentally flawed, or</li>\n<li>reject the premise that a <a href=\"https://en.wikipedia.org/wiki/Non-dual\">dualistic</a> answer can or will be given.</li>\n</ul>\n","folder":0},{"path":"home/knowledge/narrative","name":"Narrative","parent":"home/knowledge","contents":"<p>Stories are the building block of everything we know as human beings. Our brain is hardwired to store our memories in compressed, cohesive narratives. We can take pretty much any series of events, and string them together in any narrative, and through that we find meaning and purpose.</p>\n<p>I&#39;m starting to find a lot of success in taking control of the storytelling of my own life, and stringing my own events together in a purposely-crafted story of challenge, overcoming, and growth. These stories are fulfilling and encouraging, like a self-fulfilling prophecy where the stories of success you tell allow you to be optimistic enough to achieve even greater succeses.</p>\n<p>Dreams are the stories we tell ourselves of who we might become, and so it&#39;s important that you also tell those stories well and with purpose, instead of leaving the story telling to a background process in your brain, the result of which you might not like.</p>\n","folder":0},{"path":"home/knowledge/philosophy","name":"Philosophy","parent":"home/knowledge","contents":"<p>In terms of what I believe the most likely to be true, I am a:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Determinism\">Hard determinist</a>, meaning that free will is impossible and your choices are a result of some conbination of your nature and nurture</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Eliminative_materialism\">Eliminative materialist</a>, meaning that, in particular, consciousness does not exist, and the term will be eventually eliminated as neuroscience progresses</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Absurdism\">Absurdist</a>, meaning that you must awknowledge that there is no meaning or purpose to our lives and universe, but despite this, our biology demands we pursue it and believe in it</li>\n</ul>\n","folder":0},{"path":"home/knowledge/probability","name":"Probability","parent":"home/knowledge","contents":"<p>A common thread I keep hearing is that the probabilities have changed in a way that is not immediately emotionally intuitive.</p>\n<p>We expect, if we apply effort over time, for value to come to us in a way that can fluctuate but usually stays close to the average.</p>\n<p>What we get in the modern world is value that comes in bursts. A large amount of effort goes to waste, but it&#39;s worth it for the small amount of effort that nets a very high return.</p>\n<p>This concept is talked about in The Black Swan by Nassim Nicholas Taleb, and in Sam Altman&#39;s strategy for dealing with meetings:</p>\n<blockquote>\n<p> Having an open network is valuable; though probably 90% of the random meetings I take are a waste of time, the other 10% really make up for it. - <a href=\"http://blog.samaltman.com/productivity\">Productivity</a> by Sam Altman</p>\n</blockquote>\n<p>I think this idea extends much further, and it&#39;s an area I&#39;m really interested into looking at.</p>\n","folder":0},{"path":"home/knowledge/books","name":"Books","parent":"home/knowledge","contents":"<p>A list of the books I&#39;ve read and would like to re-read.</p>\n<h2 id=\"reading\">Reading</h2>\n<p>Reading is still the most viable way to take in new information from diverse sources. It can be easily paused, rewinded, and played at whatever pace you&#39;d like. It doesn&#39;t produce sound, expire, or become unavailable.</p>\n<p>I want to read more. I should start with fiction, but sometimes I lose track of character names. I might want to start noting down minor details so that I&#39;m less likely to become lost and disinterested. </p>\n<h2 id=\"to-read\">To Read</h2>\n<ul>\n<li>Never Split the Difference</li>\n</ul>\n<h3 id=\"recommendations-from-chad-mazolla\">Recommendations from Chad Mazolla</h3>\n<ul>\n<li>Lincoln in the Bardo</li>\n<li>On the Shortness Of Life</li>\n<li>When Breath Becomes Air</li>\n<li>Man&#39;s Search For Meaning</li>\n</ul>\n<h3 id=\"recommendations-from-ryan-holiday\">Recommendations from Ryan Holiday</h3>\n<ul>\n<li>A Calendar of Wisdom: Daily Thoughts To Nourish the Soul</li>\n<li>The Laws of Human Nature</li>\n<li>The Fall</li>\n</ul>\n<h4 id=\"2017\">2017</h4>\n<ul>\n<li>Montaigne &amp; Magellan by Stefan Zweig</li>\n</ul>\n","folder":5},{"path":"home/knowledge/sources","name":"Sources","parent":"home/knowledge","contents":"<p>A list of great people, repositories, things, and projects, which produce content that I should take more time to find inspriation in and reflect on.</p>\n","folder":3}]}}
