{"path":"home/knowledge","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/knowledge","name":"Knowledge","parent":"home","contents":"","folder":13},"children_notes":[{"path":"home/knowledge/narrative","name":"Narrative","parent":"home/knowledge","contents":"<p>Stories are the building block of everything we know as human beings. Our brain is hardwired to store our memories in compressed, cohesive narratives. We can take pretty much any series of events, and string them together in any narrative, and through that we find meaning and purpose.</p>\n<p>I&#39;m starting to find a lot of success in taking control of the storytelling of my own life, and stringing my own events together in a purposely-crafted story of challenge, overcoming, and growth. These stories are fulfilling and encouraging, like a self-fulfilling prophecy where the stories of success you tell allow you to be optimistic enough to achieve even greater succeses.</p>\n<p>Dreams are the stories we tell ourselves of who we might become, and so it&#39;s important that you also tell those stories well and with purpose, instead of leaving the story telling to a background process in your brain, the result of which you might not like.</p>\n","folder":0},{"path":"home/knowledge/probability","name":"Probability","parent":"home/knowledge","contents":"<p>We expect, if we apply effort over time, for value to come to us in a way that can fluctuate but usually stays close to the average.</p>\n<p>What we get in the modern world is value that comes in bursts. A large amount of effort goes to waste, but it&#39;s worth it for the small amount of effort that nets a very high return.</p>\n<p>This concept is talked about in The Black Swan by Nassim Nicholas Taleb, and in Sam Altman&#39;s strategy for dealing with meetings:</p>\n<blockquote>\n<p> Having an open network is valuable; though probably 90% of the random meetings I take are a waste of time, the other 10% really make up for it. - <a href=\"http://blog.samaltman.com/productivity\">Productivity</a> by Sam Altman</p>\n</blockquote>\n<p>This probably applies to:</p>\n<ul>\n<li>Meetings, as suggested</li>\n<li>Books read</li>\n<li>Projects taken up</li>\n<li>People met</li>\n</ul>\n","folder":0},{"path":"home/knowledge/books","name":"Books","parent":"home/knowledge","contents":"<p>A list of the books I&#39;ve read and would like to re-read.</p>\n<h2 id=\"reading\">Reading</h2>\n<p>Reading is still the most viable way to take in new information from diverse sources. It can be easily paused, rewinded, and played at whatever pace you&#39;d like. It doesn&#39;t produce sound, expire, or become unavailable.</p>\n<p>I want to read more. I should start with fiction, but sometimes I lose track of character names. I might want to start noting down minor details so that I&#39;m less likely to become lost and disinterested. </p>\n<h2 id=\"to-read\">To Read</h2>\n<ul>\n<li>Never Split the Difference</li>\n</ul>\n<h3 id=\"recommendations-from-chad-mazolla\">Recommendations from Chad Mazolla</h3>\n<ul>\n<li>Lincoln in the Bardo</li>\n<li>On the Shortness Of Life</li>\n<li>When Breath Becomes Air</li>\n<li>Man&#39;s Search For Meaning</li>\n</ul>\n<h3 id=\"recommendations-from-ryan-holiday\">Recommendations from Ryan Holiday</h3>\n<ul>\n<li>A Calendar of Wisdom: Daily Thoughts To Nourish the Soul</li>\n<li>The Laws of Human Nature</li>\n<li>The Fall</li>\n</ul>\n<h4 id=\"2017\">2017</h4>\n<ul>\n<li>Montaigne &amp; Magellan by Stefan Zweig</li>\n</ul>\n","folder":2},{"path":"home/knowledge/sources","name":"Sources","parent":"home/knowledge","contents":"<p>A list of great people, repositories, things, and projects, which produce content that I should take more time to find inspriation in and reflect on.</p>\n","folder":3},{"path":"home/knowledge/work","name":"Work","parent":"home/knowledge","contents":"<h2 id=\"what-do-you-work-on-\">What do you work on?</h2>\n<p>You should work on, first and foremost, difficult challenges.</p>\n<p>Don&#39;t care too much about prestige:</p>\n<blockquote>\n<p>Prestige is just fossilized inspiration. If you do anything well enough, you&#39;ll make it prestigious. Plenty of things we now consider prestigious were anything but at first. Jazz comes to mind—though almost any established art form would do. So just do what you like, and let prestige take care of itself. - <a href=\"http://www.paulgraham.com/love.html\">Paul Graham</a></p>\n</blockquote>\n<h2 id=\"how-do-you-work-\">How do you work?</h2>\n<p>In my experience, work is easiest and most productive when you&#39;re interested in a problem. This makes todo lists hard to follow, since you&#39;ll see a list of complicated tasks rather than interesting problems to solve. One way you could combat that is by reading a task and thinking about the vision behind it - consider the intricacies, purpose, and meaning.</p>\n","folder":3}]}}
