{"path":"home/strategy/reviews/march","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/strategy/reviews/march","name":"March","parent":"home/strategy/reviews","contents":"","folder":2},"children_notes":[{"path":"home/strategy/reviews/march/exercise","name":"Exercise","parent":"home/strategy/reviews/march","contents":"<h2 id=\"progress\">Progress</h2>\n<h3 id=\"plan-change\">Plan Change</h3>\n<p>In November 2018, I changed from <em>5/3/1</em> to <em>GZCLP</em>. Four months later, in March 2019, I decided to switch back to <em>5/3/1</em>, with an assistance template called <em>Boring But Big</em>.</p>\n<p>I&#39;ve reviewed my progress in training through the past 8 months below.</p>\n<h4 id=\"progression-through-5-3-1-for-beginners\">Progression through 5/3/1 For Beginners</h4>\n<p>There are 8 sets in these lifts, but this only counts the highest volume set.</p>\n<table>\n<thead>\n<tr>\n<th>Workout</th>\n<th>AUG 23 2018</th>\n<th>NOV 19 2018</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Squat</td>\n<td>6 x 37.5</td>\n<td>3 x 47.5</td>\n</tr>\n<tr>\n<td>Overhead Press</td>\n<td>5 x 25</td>\n<td>5 x 27.5</td>\n</tr>\n<tr>\n<td>Bench Press</td>\n<td>7 x 32.5</td>\n<td>6 x 37.5</td>\n</tr>\n<tr>\n<td>Deadlift</td>\n<td>7 x 37.5</td>\n<td>5 x 50</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"progression-through-gzclp\">Progression through GZCLP</h4>\n<table>\n<thead>\n<tr>\n<th>Workout</th>\n<th>Nov 26 2018</th>\n<th>MAR 04 2019</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Squat</td>\n<td>3 x 50 - AMRAP 3</td>\n<td>3 x 80 - AMRAP 3</td>\n</tr>\n<tr>\n<td>Overhead Press</td>\n<td>3 x 30 - AMRAP 3</td>\n<td>2 x 36.25 - AMRAP 2</td>\n</tr>\n<tr>\n<td>Bench Press</td>\n<td>3 x 35 - AMRAP 3</td>\n<td>3 x 47.5 - AMRAP 3</td>\n</tr>\n<tr>\n<td>Deadlift</td>\n<td>3 x 50 - AMRAP 5</td>\n<td>3 x 75 - AMRAP 4</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"comparison\">Comparison</h4>\n<p>Over eight months of tracked data, the <a href=\"https://strengthlevel.com/strength-standards\">strength standards</a> say that I rank about the same for all my lifts, given my increased bodyweight. I&#39;ve gained somewhere around 5-7kg of weight, probably mostly muscle.</p>\n<h2 id=\"evaluation\">Evaluation</h2>\n<blockquote>\n<p> &quot;Work, sleep, family, fitness, or friends--pick three. It&#39;s true. In order to kick ass and do big things, I think you have to be imbalanced. I&#39;m sure there are exceptions, but every person I&#39;ve seen riding on a rocket ship was imbalanced while that rocket ship was being built. You have to decide if you want it,&quot;</p>\n</blockquote>\n<p>In April 2018, I casually brang up the idea of going to the gym as a fun way to work off the stress from studying. And although my friends dropped out, I stayed, coming in as often as I practically could. Now here I am, one year having passed from the day I wandered in to the weights floor and tried to get my bearings.</p>\n<p>It&#39;s sobering to see that, after all this time, my progress has been consistently fluctuating around less than average.</p>\n<p>The good news is that &#39;less than average&#39; is still progress, and positive progress beats the true average of zero change. I&#39;m more fit, and now I can lift more. This is pretty good.</p>\n<p>Strength is a curve, where beginners make rapid gains and then they start to get dragged down after a few years as the weight gain shrinks and biological limits are approached. After two to five years of regular training, you&#39;ll reach the a steep plateau where you&#39;ll have reached your maximum potential.</p>\n<p>Imagine I dedicated myself to training. After two years, I&#39;ll be 20. What am I going to do? Stop training and enjoy my strength for sixty more odd years? It&#39;s laughable to imagine that after all this time the destination would be to leave the gym and just start doing something else.</p>\n<p>The curve is unyielding, and it&#39;s kind towards beginners. Whether it takes two, four, or six more years to achieve my maximum potential, I don&#39;t think it really matters. I can try my best to optimize my food intake and my exercise technique, but less than average over a long period of time is more than enough.</p>\n","folder":0},{"path":"home/strategy/reviews/march/goals","name":"Goals","parent":"home/strategy/reviews/march","contents":"<h1 id=\"explore\">Explore</h1>\n<h1 id=\"connect\">Connect</h1>\n<h1 id=\"prioritize\">Prioritize</h1>\n","folder":0}]}}
