{"path":"home/blog","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/blog","name":"Blog","parent":"home","order":1,"contents":"","folder":4,"children":[{"path":"home/blog/falseAndRealProgress","name":"False And Real Progress","parent":"home/blog","background":".png","order":3,"contents":"<p>I&#39;ve been experiencing a certain type of problem in my life recently. Simply put, it seems that our intuitions are not well primed to figure out if we&#39;re making high quality progress, and we can&#39;t rely on these intuitions especially as the tasks we&#39;re doing become more and more unclear.</p>\n<p>Understanding why is simple. It would make sense for our brains to care about the progress we&#39;re making so that we prioritize survival in a dangerous environment. But the tasks that help us survive have some unique characteristics: they are easily measurable and tracked, like herding cattle, lighting a fire, cooking food, or soothing a crying child.  Now, the difference between productivity and unproductivity is as slight as the difference between one series of keypresses and another series of keypresses. It&#39;s no wonder that our intuitions get it wrong.</p>\n<p>But the danger here is not that it&#39;s simply wrong, it&#39;s dangerously wrong. Over my first year in college, I thought that I ought to do project work and make my time in my course actually useful. A noble goal, but it was quickly forgotten about when it was replaced with a preoccupation to engage in the various intricacies of college work. To clarify, it is not that the work was hard: the first year was particularly easy and the workload very light. But the alarm bells that alert you to laziness did not sound, and so I did close to nothing with my free time. Looking back, it is startling how easy it is to not even consider if what you are doing is valuable, or to even shun any considerations out of your working conciousness. </p>\n<p>When I settled in to first year, I did what now seems like a whole lot of nothing. But it was comfortable - college work is clear, well defined, and has beautifully linear progression. You can pinpoint where you are in relation to the entire whole at any one time. You know that when you are clicking keys, stuff is getting done.</p>\n<p>Real life is considerably more tough. Nobody reminds you to get your work done. And most of all, there is no such linear visible progression. Continuing with the analogy of software projects, say you write a line of code - it is not at all clear whether you have just advanced by one task item or doomed yourself to a week of desperate bug fixing. Even worse, writing shitty code can cause effects down the line that are not visible the moment you write it, which skews the reward curve to a time scale that our primitive brains simply cannot intuitively grasp.</p>\n<p>We are used to carving a trinket out of wood, the progress of which is immediately visible, easily judged and somewhat clearly mapped. We are not used to working in today&#39;s world, where a single thought can leapfrog you years in advance, and the abscence of one can cause you to waste the precious time we have assigned to us.</p>\n<p>It&#39;s probably necessary to therefore implement a strict opinionated system of priorities. We cannot be relied on by our subconcious minds to tell us what to do anymore. And the first step, I would guess, would be constantly checking to see if what you are doing is about to push you into the future, or keep you in the past.</p>\n","folder":0},{"path":"home/blog/gettingBetterAtChoosingWhatToRead","name":"Getting Better At Choosing What To Read","parent":"home/blog","background":".png","order":1,"contents":"<p>In our lives, we consume content all the time. By content, I mean anything that&#39;s written, spoken, or shown. It&#39;s quite a no-brainer -- not many people exist that have never seen anything written or heard anything spoken -- but it gives us an interesting question. Can we, and should we, optimise the content we consume?</p>\n<p>First, some context. Humanity, for a long time, didn&#39;t have nearly as much information as we have access to now. Back in the primordial savannah, all you could get was stories from your tribe members about whatever current danger there was lurking about in the dark. If you were in a particularly advanced tribe, you could even pass on stories to your kids, forming a simple sort of culture where tales are passed on and knowledge is somewhat retained.</p>\n<p>Suffice to say, the situation has changed. It changed a lot when someone thought of a cool idea of a machine that writes books, and then it changed really sharply when someone thought of the Internet. I&#39;m not even going to bother throwing numbers at you that neither you nor I can even comprehend the scale of, but let&#39;s leave it at this: there is far more information now than there ever was.</p>\n<p>We are at the awkward teenager years of humanity where the rate at which we can consume information is super slow, and so, we have a desperate need for curation. And the real kicker is that since this is first time we&#39;ve experienced such a massive amount of information with such high availability, any intuitions about how to curate this information fall far short. </p>\n<h2 id=\"refining-curation\">Refining curation</h2>\n<p>Of course, to fix these problems fully would require radically reconstructing our brains. But even with our current limited hardware, I bet we can adapt.</p>\n<p>If we&#39;re looking for a personal advantage in curation, we can settle just for refining our personal methodologies. Since the world is somewhat competitive, and knowledge compounds like interest does, becoming slightly more effective at this task will yield large returns later on in life.</p>\n<p>How, in particular, we curate is a question that will determine much of our lives, and so is something that can&#39;t be totally addressed in a blog post. But I can give a first stab at an answer to this question that takes in a couple of assumptions. </p>\n<p>First, it assumes you&#39;re pretty early on in the learning process. You&#39;re still in education, or you just finished education, and you want a handle on the deep fundamentals more than you&#39;d want to grasp superficial technicalities. Depending on your world perspective, you could say you never really finish education, so this assumption could hold true forever.</p>\n<p>Second, it assumes that what you wanted to learn about does not change fast. This is correlated to how new the field is. This doesn&#39;t work at all for computer programming. It works slightly better but still pretty poorly for general computer science. If you get more broad, it works pretty well for mathematics. And for basic human behaviour, which did not change much over the past few millenia, it works perfectly. </p>\n<h3 id=\"1-consume-mostly-longform-content\">1. Consume mostly longform content</h3>\n<p>This means you should basically mostly read.</p>\n<p>Though the allure of bite-sized snippets of information is charming, the simple truth is that we need to engage with what we&#39;re reading in order to get anything at all out of it. It&#39;s not enough to read a book summary. Quite often, it&#39;s not even enough to read a book.</p>\n<p>Learning requires engagement and struggle. If what you&#39;re reading is easy, you&#39;re not improving. Durable knowledge is forged through frustrations, through feeling like you&#39;re stuck, and being regularly confused.</p>\n<h3 id=\"2-read-old-books\">2. Read old books</h3>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Lindy_effect\">Lindy effect</a> is the theory that if you see a book today, and it was written a long time ago, the chances are that it&#39;s quite good. A book survives proportional to it&#39;s value, where disappointing books die off quite quickly and great ones impact the culture for a long time. If a book exists today, and it is quite old, you can expect that it has some great ideas or stories that kept the book alive.</p>\n<h3 id=\"3-read-diversely\">3. Read diversely</h3>\n<p>Just like a good training routine gives you a few core movements that cover a wide range of muscles, you should read books that cover a wide range of topics, at least at the beginning. If you skip building a strong general foundation, you&#39;ll seem to progress faster but you&#39;ll stumble later on.</p>\n<p>This is especially true in a world which changes very fast. Being too specialized may seem productive, but just like a training routine which targets only one muscle, you&#39;ll die off whenever the world changes next, which will probably be sooner than you think. And at that point, your specialisation will be useless whenever the next big disruption plunges you into a world you don&#39;t even know the basics of.</p>\n","folder":0},{"path":"home/blog/theRoleAndPlaceOfClothes","name":"The Role And Place Of Clothes","parent":"home/blog","background":".png","order":3,"published":false,"contents":"<p>A lot of our lives revolves around optimisation. We want to optimise how many hours we work, or even how deeply we love one another.</p>\n<p>I approached clothes from the same front. We wear clothes every day, and so clearly refining the clothes I wear would have a large impact. On what? I do not quite know.</p>\n<p>What, indeed, do clothes impact? Well, they have a large role in first impressions. They probably play a part in perceived confidence or perceived social value. And that should be argument enough to declare clothes as important.</p>\n<p>But I think that is only an infinitesmal part of the story. First and foremost, our clothes are an extension of who we are. In <em>The Order of Time</em>, Carlo Rovelli comments that the way we perceive ourselves is through the mirror of how we believe others perceive us. We became so good at intuiting what other people are thinking, it became necessary to start seeing ourselves from their eyes, to guess what they felt about us, to guess how our tone of voice affects them, and to guess how our clothes made them feel. Our self image is a tapestry of different opinions and perspectives about who we are patched together.</p>\n<hr>\n<p>Imagine you were a new type of person who moved in to your local area from somewhere far away. To get to grips with this foregin land, you decide to take advice only if it is fully proven and studied. And so you would optimise your actions to give you the most reward with the smallest effort you can, so that your life is maximally good.</p>\n<p>This could seem like the ideal human being you should be. Rational, straightfoward, and it would cut out all of the superstitions and unfounded beliefs that we all carry deep in our self identity.</p>\n","folder":0},{"path":"home/blog/whatIsThisBlogFor","name":"What Is This Blog For","parent":"home/blog","background":".png","order":2,"contents":"<p>Now would probably be a good time to decide what this blog is about.</p>\n<p>I&#39;m planning on letting my curiosity dictate what I&#39;ll write about, and hope that later on I stumble on some concepts I find useful. I don&#39;t have enough experience in any one field to refine the scope of this blog, and I also don&#39;t want to kill my natural interest by trying to judge if a non-existant reader would theoretically enjoy my post. So this series of posts will be a little rambling.</p>\n<p>I&#39;m betting on the following:</p>\n<ul>\n<li>I won&#39;t want to write in this blog if I needed to optimize for metrics and I wasn&#39;t hitting them, making me feel demotivated</li>\n<li>It is improbable I will hit any metrics, nor would I really want to at this stage of my life</li>\n<li>Writing in this blog will make my writing and thoughts of higher quality</li>\n<li>This will pay off later in life</li>\n</ul>\n<p>This blog will probably <em>not</em> be representative of what I actually do, so you should Google me if that is the information you&#39;re looking for.</p>\n","folder":0}]},"children_notes":[{"path":"home/blog/theRoleAndPlaceOfClothes","name":"The Role And Place Of Clothes","parent":"home/blog","background":".png","order":3,"published":false,"contents":"<p>A lot of our lives revolves around optimisation. We want to optimise how many hours we work, or even how deeply we love one another.</p>\n<p>I approached clothes from the same front. We wear clothes every day, and so clearly refining the clothes I wear would have a large impact. On what? I do not quite know.</p>\n<p>What, indeed, do clothes impact? Well, they have a large role in first impressions. They probably play a part in perceived confidence or perceived social value. And that should be argument enough to declare clothes as important.</p>\n<p>But I think that is only an infinitesmal part of the story. First and foremost, our clothes are an extension of who we are. In <em>The Order of Time</em>, Carlo Rovelli comments that the way we perceive ourselves is through the mirror of how we believe others perceive us. We became so good at intuiting what other people are thinking, it became necessary to start seeing ourselves from their eyes, to guess what they felt about us, to guess how our tone of voice affects them, and to guess how our clothes made them feel. Our self image is a tapestry of different opinions and perspectives about who we are patched together.</p>\n<hr>\n<p>Imagine you were a new type of person who moved in to your local area from somewhere far away. To get to grips with this foregin land, you decide to take advice only if it is fully proven and studied. And so you would optimise your actions to give you the most reward with the smallest effort you can, so that your life is maximally good.</p>\n<p>This could seem like the ideal human being you should be. Rational, straightfoward, and it would cut out all of the superstitions and unfounded beliefs that we all carry deep in our self identity.</p>\n","folder":0},{"path":"home/blog/falseAndRealProgress","name":"False And Real Progress","parent":"home/blog","background":".png","order":3,"contents":"<p>I&#39;ve been experiencing a certain type of problem in my life recently. Simply put, it seems that our intuitions are not well primed to figure out if we&#39;re making high quality progress, and we can&#39;t rely on these intuitions especially as the tasks we&#39;re doing become more and more unclear.</p>\n<p>Understanding why is simple. It would make sense for our brains to care about the progress we&#39;re making so that we prioritize survival in a dangerous environment. But the tasks that help us survive have some unique characteristics: they are easily measurable and tracked, like herding cattle, lighting a fire, cooking food, or soothing a crying child.  Now, the difference between productivity and unproductivity is as slight as the difference between one series of keypresses and another series of keypresses. It&#39;s no wonder that our intuitions get it wrong.</p>\n<p>But the danger here is not that it&#39;s simply wrong, it&#39;s dangerously wrong. Over my first year in college, I thought that I ought to do project work and make my time in my course actually useful. A noble goal, but it was quickly forgotten about when it was replaced with a preoccupation to engage in the various intricacies of college work. To clarify, it is not that the work was hard: the first year was particularly easy and the workload very light. But the alarm bells that alert you to laziness did not sound, and so I did close to nothing with my free time. Looking back, it is startling how easy it is to not even consider if what you are doing is valuable, or to even shun any considerations out of your working conciousness. </p>\n<p>When I settled in to first year, I did what now seems like a whole lot of nothing. But it was comfortable - college work is clear, well defined, and has beautifully linear progression. You can pinpoint where you are in relation to the entire whole at any one time. You know that when you are clicking keys, stuff is getting done.</p>\n<p>Real life is considerably more tough. Nobody reminds you to get your work done. And most of all, there is no such linear visible progression. Continuing with the analogy of software projects, say you write a line of code - it is not at all clear whether you have just advanced by one task item or doomed yourself to a week of desperate bug fixing. Even worse, writing shitty code can cause effects down the line that are not visible the moment you write it, which skews the reward curve to a time scale that our primitive brains simply cannot intuitively grasp.</p>\n<p>We are used to carving a trinket out of wood, the progress of which is immediately visible, easily judged and somewhat clearly mapped. We are not used to working in today&#39;s world, where a single thought can leapfrog you years in advance, and the abscence of one can cause you to waste the precious time we have assigned to us.</p>\n<p>It&#39;s probably necessary to therefore implement a strict opinionated system of priorities. We cannot be relied on by our subconcious minds to tell us what to do anymore. And the first step, I would guess, would be constantly checking to see if what you are doing is about to push you into the future, or keep you in the past.</p>\n","folder":0},{"path":"home/blog/whatIsThisBlogFor","name":"What Is This Blog For","parent":"home/blog","background":".png","order":2,"contents":"<p>Now would probably be a good time to decide what this blog is about.</p>\n<p>I&#39;m planning on letting my curiosity dictate what I&#39;ll write about, and hope that later on I stumble on some concepts I find useful. I don&#39;t have enough experience in any one field to refine the scope of this blog, and I also don&#39;t want to kill my natural interest by trying to judge if a non-existant reader would theoretically enjoy my post. So this series of posts will be a little rambling.</p>\n<p>I&#39;m betting on the following:</p>\n<ul>\n<li>I won&#39;t want to write in this blog if I needed to optimize for metrics and I wasn&#39;t hitting them, making me feel demotivated</li>\n<li>It is improbable I will hit any metrics, nor would I really want to at this stage of my life</li>\n<li>Writing in this blog will make my writing and thoughts of higher quality</li>\n<li>This will pay off later in life</li>\n</ul>\n<p>This blog will probably <em>not</em> be representative of what I actually do, so you should Google me if that is the information you&#39;re looking for.</p>\n","folder":0},{"path":"home/blog/gettingBetterAtChoosingWhatToRead","name":"Getting Better At Choosing What To Read","parent":"home/blog","background":".png","order":1,"contents":"<p>In our lives, we consume content all the time. By content, I mean anything that&#39;s written, spoken, or shown. It&#39;s quite a no-brainer -- not many people exist that have never seen anything written or heard anything spoken -- but it gives us an interesting question. Can we, and should we, optimise the content we consume?</p>\n<p>First, some context. Humanity, for a long time, didn&#39;t have nearly as much information as we have access to now. Back in the primordial savannah, all you could get was stories from your tribe members about whatever current danger there was lurking about in the dark. If you were in a particularly advanced tribe, you could even pass on stories to your kids, forming a simple sort of culture where tales are passed on and knowledge is somewhat retained.</p>\n<p>Suffice to say, the situation has changed. It changed a lot when someone thought of a cool idea of a machine that writes books, and then it changed really sharply when someone thought of the Internet. I&#39;m not even going to bother throwing numbers at you that neither you nor I can even comprehend the scale of, but let&#39;s leave it at this: there is far more information now than there ever was.</p>\n<p>We are at the awkward teenager years of humanity where the rate at which we can consume information is super slow, and so, we have a desperate need for curation. And the real kicker is that since this is first time we&#39;ve experienced such a massive amount of information with such high availability, any intuitions about how to curate this information fall far short. </p>\n<h2 id=\"refining-curation\">Refining curation</h2>\n<p>Of course, to fix these problems fully would require radically reconstructing our brains. But even with our current limited hardware, I bet we can adapt.</p>\n<p>If we&#39;re looking for a personal advantage in curation, we can settle just for refining our personal methodologies. Since the world is somewhat competitive, and knowledge compounds like interest does, becoming slightly more effective at this task will yield large returns later on in life.</p>\n<p>How, in particular, we curate is a question that will determine much of our lives, and so is something that can&#39;t be totally addressed in a blog post. But I can give a first stab at an answer to this question that takes in a couple of assumptions. </p>\n<p>First, it assumes you&#39;re pretty early on in the learning process. You&#39;re still in education, or you just finished education, and you want a handle on the deep fundamentals more than you&#39;d want to grasp superficial technicalities. Depending on your world perspective, you could say you never really finish education, so this assumption could hold true forever.</p>\n<p>Second, it assumes that what you wanted to learn about does not change fast. This is correlated to how new the field is. This doesn&#39;t work at all for computer programming. It works slightly better but still pretty poorly for general computer science. If you get more broad, it works pretty well for mathematics. And for basic human behaviour, which did not change much over the past few millenia, it works perfectly. </p>\n<h3 id=\"1-consume-mostly-longform-content\">1. Consume mostly longform content</h3>\n<p>This means you should basically mostly read.</p>\n<p>Though the allure of bite-sized snippets of information is charming, the simple truth is that we need to engage with what we&#39;re reading in order to get anything at all out of it. It&#39;s not enough to read a book summary. Quite often, it&#39;s not even enough to read a book.</p>\n<p>Learning requires engagement and struggle. If what you&#39;re reading is easy, you&#39;re not improving. Durable knowledge is forged through frustrations, through feeling like you&#39;re stuck, and being regularly confused.</p>\n<h3 id=\"2-read-old-books\">2. Read old books</h3>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Lindy_effect\">Lindy effect</a> is the theory that if you see a book today, and it was written a long time ago, the chances are that it&#39;s quite good. A book survives proportional to it&#39;s value, where disappointing books die off quite quickly and great ones impact the culture for a long time. If a book exists today, and it is quite old, you can expect that it has some great ideas or stories that kept the book alive.</p>\n<h3 id=\"3-read-diversely\">3. Read diversely</h3>\n<p>Just like a good training routine gives you a few core movements that cover a wide range of muscles, you should read books that cover a wide range of topics, at least at the beginning. If you skip building a strong general foundation, you&#39;ll seem to progress faster but you&#39;ll stumble later on.</p>\n<p>This is especially true in a world which changes very fast. Being too specialized may seem productive, but just like a training routine which targets only one muscle, you&#39;ll die off whenever the world changes next, which will probably be sooner than you think. And at that point, your specialisation will be useless whenever the next big disruption plunges you into a world you don&#39;t even know the basics of.</p>\n","folder":0}]}}
