{"path":"home/philosophy/mistakes","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/philosophy/mistakes","name":"Mistakes","parent":"home/philosophy","contents":"<h2 id=\"cultural-sentiment\">Cultural sentiment</h2>\n<p>Due to the structure of our social networks, mistakes have a more negative sentiment than was previously possible. This is for two reasons.</p>\n<p>For one, we consistently only see people&#39;s successes. In our social networks, people only want to share their successes in order to cast themselves in a better light. People&#39;s failiures are rarely shown as they are embarrased and make themselves appear less strong. This causes a negative loop where as people share less mistakes, people feel more implicitly bad about their mistakes, and less people share them.</p>\n<p>Another reason is that in our news culture, we see people grilled for mistakes all the time. Anger is one of the easiest emotions to spread, and so anger at our political representatives, our managers, employers, and people in general has reached a new high. If we are ever exposed to mistakes, we only see them in the worst possible light. If we didn&#39;t, the news wouldn&#39;t sell.</p>\n<h2 id=\"failiure-as-win\">Failiure as win</h2>\n<p>It&#39;s cliche to say that a mistake was a learning experience. But like all cliches, it&#39;s true, and the wisdom within this particular cliche proves to be very valuable.</p>\n<p>Consider this statement from a different perspective.</p>\n<p>Imagine a simple number game where you have to guess numbers within some bounds that you don&#39;t know. If your objective was to discover these bounds, it&#39;s a very bad sign indeed if you keep hitting a number within the bounds. And indeed, one wrong guess could tell you far more than ten right guesses.  </p>\n<p>A mistake is just an event that we realize we could&#39;ve handled better. The realisation part is the win. If someone isn&#39;t self-reflective, they&#39;d have made no mistakes while clearly being </p>\n<h2 id=\"success-as-loss\">Success as loss</h2>\n<p>In some scenarios, it could be </p>\n<h2 id=\"psychology-for-loss\">Psychology for loss</h2>\n<p>Failiure is a deeply-rooted painful experience, which can encourage growth and self-renewal. However, if it becomes too painful, it sucks you into a vortex where you avoid opportunities in the future for fear of screwing it up. We must recognize it&#39;s critical </p>\n","folder":1},"children_notes":[{"path":"home/philosophy/mistakes/shame","name":"Shame","parent":"home/philosophy/mistakes","contents":"<p>Shame and humiliation is a powerful negative emotion. Unlike broader forms of guilt, shame is more dangerous as it motivates us to <a href=\"https://www.psychologytoday.com/us/blog/intense-emotions-and-strong-feelings/201104/shame-concealed-contagious-and-dangerous-emotion\">hide and save face</a> from other people. This can lead to a brutal self-destructive cycle where shame begets more shame.</p>\n<h2 id=\"triggers-of-shame\">Triggers of shame</h2>\n<p>Shame will be felt when we anticipate being viewed as lacking or inadequate in our intellect, appearance, or abilities.</p>\n","folder":0}]}}
