{"path":"home/resources/health","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/resources/health","name":"Health","parent":"home/resources","contents":"<p>Health is the foundation upon which you build the rest of your work. If you&#39;re in poor health, it gets harder and harder to do the things you&#39;d like to. And if you&#39;re in good shape, that means you have more energy to do demanding work.</p>\n"},"children_notes":[{"path":"home/resources/health/mood","name":"Mood","parent":"home/resources/health","contents":"<p>People consistently underestimate how much less competent they are when they are unhappy.</p>\n<p>Sam mentions a pattern which applies to me, but I was unaware was so general:</p>\n<blockquote>\n<p>Like most people, I sometimes go through periods of a week or two where I just have no motivation to do anything (I suspect it may have something to do with nutrition).  This sucks and always seems to happen at inconvenient times.  I have not figured out what to do about it besides wait for the fog to lift, and to trust that eventually it always does.  And I generally try to avoid people and situations that put me in bad moods, which is good advice whether you care about productivity or not. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n"},{"path":"home/resources/health/nutrition","name":"Nutrition","parent":"home/resources/health","contents":"<p>I try to replace as much of my diet as is convenient with Huel, which is a powdered food replacement.</p>\n<table>\n<thead>\n<tr>\n<th>Nutritional attributes</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Flavour</td>\n<td>Huel Vanilla</td>\n</tr>\n<tr>\n<td>Calories per gram</td>\n<td>4kcal</td>\n</tr>\n<tr>\n<td>Personal serving size</td>\n<td>190g</td>\n</tr>\n<tr>\n<td>Calories per serving</td>\n<td>760kcal</td>\n</tr>\n<tr>\n<td>Calorie daily target</td>\n<td>3000kcal</td>\n</tr>\n<tr>\n<td>Huel meals per day</td>\n<td>4</td>\n</tr>\n</tbody>\n</table>\n<p>Powdered food offers a significant benefit on time savings and nutritional content. Huel usually accomodates for 50% of my calorie intake.</p>\n<h2 id=\"other-food\">Other food</h2>\n<blockquote>\n<p>Eating lots of sugar is the thing that makes me feel the worst and that I try hardest to avoid.  I also try to avoid foods that aggravate my digestion or spike up inflammation (for example, very spicy foods).  I don’t have much willpower when it comes to sweet things, so I mostly just try to keep junk food out of the house. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n"},{"path":"home/resources/health/sleep","name":"Sleep","parent":"home/resources/health","contents":"<p>You know pretty quickly when you didn&#39;t sleep too well, and you&#39;ll know it for the rest of your day. That&#39;s why it&#39;s important to make sure you&#39;re getting both the time and quality you need.</p>\n<blockquote>\n<p>Sleep seems to be the most important physical factor in productivity - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<h2 id=\"quality\">Quality</h2>\n<p>I&#39;m sensitive to caffeine, even in tea, which used to be my favourite way to end an evening.  The difference cutting out tea makes is big. I&#39;ll get some decaf tea to be able to start that habit again.</p>\n<p>On all days for the past few months, ten minutes to three hours have been eaten up by lying in bed or going straight back to sleep. I think this is a hormone thing, where teenagers aren&#39;t supposed to wake up at 8am. </p>\n<p>Another factor could be that it&#39;s an issue with the winter season, caused by the lack of light and exposure to the outdoors. I need to start using the LED light more consistently. </p>\n<p>The time I go to sleep tends to drift in ten minute increments until I force it to move backwards again. This points further towards the hormone theory, where my body is trying to adjust.</p>\n<p>When I&#39;m not in college, I could try to shift back to the last schedule I know which worked - which was 4am to 12pm.</p>\n<p>This could work:</p>\n<blockquote>\n<p>This is likely to be controversial, but I take a low dose of sleeping pills (like a third of a normal dose) or a very low dose of cannabis whenever I can’t sleep.  I am a bad sleeper in general, and a particularly bad sleeper when I travel.  It likely has tradeoffs, but so does not sleeping well. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n"}]}}
