{"path":"/","templateID":0,"sharedPropsHashes":{},"localProps":{"children_notes":[{"path":"home/ambition","name":"Ambition","parent":"home","contents":"<p>Collection of plans that I&#39;m trying to execute.</p>\n","folder":1},{"path":"home/emotion","name":"Emotion","parent":"home","contents":"<p>People consistently underestimate how much less competent they are when they are unhappy.</p>\n<p>Sam mentions a pattern which applies to me, but I was unaware was so general:</p>\n<blockquote>\n<p>Like most people, I sometimes go through periods of a week or two where I just have no motivation to do anything (I suspect it may have something to do with nutrition).  This sucks and always seems to happen at inconvenient times.  I have not figured out what to do about it besides wait for the fog to lift, and to trust that eventually it always does.  And I generally try to avoid people and situations that put me in bad moods, which is good advice whether you care about productivity or not. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<h2 id=\"winter\">Winter</h2>\n<p>Ireland has the misfortune of being one of the countries with the least amount of sunlight hours.</p>\n<p><img src=\"http://www.city-data.com/forum/attachments/weather/122054d1386546899-solar-irradiation-map-world-solargis-solar-map-dni-world-map\" alt=\"Map of sunlight hours.\"></p>\n<p>Sometimes, the lack of sunlight can be really demotivating. So far, what I&#39;ve found that works is keeping a journal with a list of sequential bullet-pointed tasks for your day, so that there is never any doubt about what&#39;s next. The smaller the tasks are the better.</p>\n","folder":2},{"path":"home/work","name":"Work","parent":"home","contents":"<p>Some of my current active projects.</p>\n<h2 id=\"what-do-you-work-on-\">What do you work on?</h2>\n<p>You should work on, first and foremost, difficult challenges.</p>\n<p>Don&#39;t care too much about prestige:</p>\n<blockquote>\n<p>Prestige is just fossilized inspiration. If you do anything well enough, you&#39;ll make it prestigious. Plenty of things we now consider prestigious were anything but at first. Jazz comes to mind—though almost any established art form would do. So just do what you like, and let prestige take care of itself. - <a href=\"http://www.paulgraham.com/love.html\">Paul Graham</a></p>\n</blockquote>\n<h2 id=\"how-do-you-work-\">How do you work?</h2>\n<p>In my experience, work is easiest and most productive when you&#39;re interested in a problem. This makes todo lists hard to follow, since you&#39;ll see a list of complicated tasks rather than interesting problems to solve. One way you could combat that is by reading a task and thinking about the vision behind it - consider the intricacies, purpose, and meaning.</p>\n","folder":1},{"path":"home/knowledge","name":"Knowledge","parent":"home","contents":"","folder":11},{"path":"home/resources","name":"Resources","parent":"home","contents":"<p>Resources, like time and money, are scarce. A lot of what we do is finding different ways to transform, manage, and control these resources.</p>\n","folder":4}]}}
