{"path":"/","templateID":0,"sharedPropsHashes":{},"localProps":{"children_notes":[{"path":"home/essays","name":"Essays","parent":"home","contents":"","folder":1},{"path":"home/work","name":"Work","parent":"home","contents":"","folder":3},{"path":"home/emotion","name":"Emotion","parent":"home","contents":"<p>People consistently underestimate how much less competent they are when they are unhappy.</p>\n<p>Sam mentions a pattern which sometimes applies to me:</p>\n<blockquote>\n<p>Like most people, I sometimes go through periods of a week or two where I just have no motivation to do anything (I suspect it may have something to do with nutrition).  This sucks and always seems to happen at inconvenient times.  I have not figured out what to do about it besides wait for the fog to lift, and to trust that eventually it always does.  And I generally try to avoid people and situations that put me in bad moods, which is good advice whether you care about productivity or not. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<p>I can&#39;t get the motivation and enthusiasm to do productive work on some days. This is usually solved by going outside or socializing more. It probably is also helped by taking small amounts of time off for leisure.</p>\n<h2 id=\"winter\">Winter</h2>\n<p>Ireland has the misfortune of being one of the countries with the least amount of sunlight hours.</p>\n<p>Sometimes, the lack of sunlight can be really demotivating. So far, what I&#39;ve found that works is keeping a journal with a list of sequential bullet-pointed tasks for your day, so that there is never any doubt about what&#39;s next. The smaller the tasks are the better.</p>\n","folder":7},{"path":"home/resources","name":"Resources","parent":"home","contents":"<p>Resources, like time and money, are scarce. A lot of what we do is finding different ways to transform, manage, and control these resources.</p>\n","folder":4},{"path":"home/knowledge","name":"Knowledge","parent":"home","contents":"","folder":17},{"path":"home/plans","name":"Plans","parent":"home","contents":"<p>Collection of plans that I&#39;m trying to execute.</p>\n","folder":11}]}}
