{"path":"/","templateID":0,"sharedPropsHashes":{},"localProps":{"children_notes":[{"path":"home/knowledgeSeries","name":"Knowledge Series","parent":"home","contents":"","folder":5,"children":[{"path":"home/knowledgeSeries/inspiration","name":"Inspiration","parent":"home/knowledgeSeries","contents":"<p>A collection of things I like. </p>\n<p>Nothing original has ever been made - it&#39;s a matter of transforming other people&#39;s work until you&#39;ve found something new.</p>\n<h2 id=\"movies-films-video\">Movies, films, video</h2>\n<ul>\n<li><a href=\"https://www.imdb.com/title/tt0470752/\">Ex Machina</a></li>\n<li><a href=\"https://en.m.wikipedia.org/wiki/Indie_Game:_The_Movie\">Indie Game: The Movie</a></li>\n<li><a href=\"https://vimeo.com/170127382\">And So We Put Goldfish In The Pool</a></li>\n<li><a href=\"https://vimeo.com/235664764\">3,000 Miles</a></li>\n</ul>\n<h2 id=\"people-artists\">People, artists</h2>\n<ul>\n<li><a href=\"https://wiki.xxiivv.com/#home\">Devine Lu Livenga</a></li>\n<li><a href=\"http://blog.samaltman.com/\">Sam Altman</a></li>\n<li><a href=\"http://www.paulgraham.com/articles.html\">Paul Graham</a></li>\n<li><a href=\"https://twitter.com/naval?\">Naval Ravikant</a></li>\n<li><a href=\"https://twitter.com/kpaxs\">Thibaut (@Kpaxs)</a></li>\n</ul>\n","folder":0},{"path":"home/knowledgeSeries/narrative","name":"Narrative","parent":"home/knowledgeSeries","contents":"<p>Stories are the building block of everything we know as human beings. Our brain is hardwired to store our memories in compressed, cohesive narratives. We can take pretty much any series of events, and string them together in any narrative, and through that we find meaning and purpose.</p>\n<p>I&#39;m starting to find a lot of success in taking control of the storytelling of my own life, and stringing my own events together in a purposely-crafted story of challenge, overcoming, and growth. These stories are fulfilling and encouraging, like a self-fulfilling prophecy where the stories of success you tell allow you to be optimistic enough to achieve even greater succeses.</p>\n<p>Dreams are the stories we tell ourselves of who we might become, and so it&#39;s important that you also tell those stories well and with purpose, instead of leaving the story telling to a background process in your brain, the result of which you might not like.</p>\n","folder":0},{"path":"home/knowledgeSeries/probability","name":"Probability","parent":"home/knowledgeSeries","contents":"<p>We expect, if we apply effort over time, for value to come to us in a way that can fluctuate but usually stays close to the average.</p>\n<p>What we get in the modern world is value that comes in bursts. A large amount of effort goes to waste, but it&#39;s worth it for the small amount of effort that nets a very high return.</p>\n<p>This concept is talked about in The Black Swan by Nassim Nicholas Taleb, and in Sam Altman&#39;s strategy for dealing with meetings:</p>\n<blockquote>\n<p> Having an open network is valuable; though probably 90% of the random meetings I take are a waste of time, the other 10% really make up for it. - <a href=\"http://blog.samaltman.com/productivity\">Productivity</a> by Sam Altman</p>\n</blockquote>\n<p>This probably applies to:</p>\n<ul>\n<li>Meetings, as suggested</li>\n<li>Books read</li>\n<li>Projects taken up</li>\n<li>People met</li>\n</ul>\n","folder":0},{"path":"home/knowledgeSeries/routines","name":"Routines","parent":"home/knowledgeSeries","contents":"<p>If you&#39;re diagnosing a problem in yourself, it&#39;s better to take a step back and consider your behaviour from a distant point of view.</p>\n<h2 id=\"diagnosing-problems\">Diagnosing Problems</h2>\n<p>Imagine you have a problem with leaving behind dishes after you eat. Every time you see those dishes, you make a mental note that you&#39;ll have to clean them soon. You beat yourself up for it slightly, and hope that this helps you change.</p>\n<p>It doesn&#39;t, because you&#39;re not improving the routine. Your time would be better spent in this scenario if you were to think of ways to make cleaning happen automatically as you go throughout your day: make cleaning dishes your hobby, habitually do it after eating, or always clean something whenever you pass by. This would instead ensure you spend your effort and willpower once, and then your dishes will clean themselves almost automatically for the rest of your life.</p>\n<h2 id=\"routines\">Routines</h2>\n<p>Almost everything in your life is a result of a routine. Any changes you make to your routines can have the potential to yield benefits for the rest of your life.</p>\n<p>Coding is also a routine. Instead of making a note that you should refactor or write cleaner code, you should make it a regular part of the process to fix things you find. That means that almost automatically, your projects will have cleaner code.</p>\n","folder":0},{"path":"home/knowledgeSeries/work","name":"Work","parent":"home/knowledgeSeries","contents":"<h2 id=\"what-do-you-work-on-\">What do you work on?</h2>\n<p>You should work on, first and foremost, difficult challenges.</p>\n<p>Don&#39;t care too much about prestige:</p>\n<blockquote>\n<p>Prestige is just fossilized inspiration. If you do anything well enough, you&#39;ll make it prestigious. Plenty of things we now consider prestigious were anything but at first. Jazz comes to mind—though almost any established art form would do. So just do what you like, and let prestige take care of itself. - <a href=\"http://www.paulgraham.com/love.html\">Paul Graham</a></p>\n</blockquote>\n<h2 id=\"how-do-you-work-\">How do you work?</h2>\n<p>In my experience, work is easiest and most productive when you&#39;re interested in a problem. This makes todo lists hard to follow, since you&#39;ll see a list of complicated tasks rather than interesting problems to solve. One way you could combat that is by reading a task and thinking about the vision behind it - consider the intricacies, purpose, and meaning.</p>\n","folder":0}]},{"path":"home/resources","name":"Resources","parent":"home","contents":"<h1 id=\"base-philosophy\">Base philosophy</h1>\n<p>Resources, like time and money, are scarce. A lot of what we do is finding different ways to transform, manage, and control these resources.</p>\n<h2 id=\"goals\">Goals</h2>\n<p>Resources like time and money don&#39;t matter to us unless we can redirect them to fill our values. It follows that the best way to manage these resources is to ensure we&#39;ve used them to fulfill our values as best as we could.</p>\n<p>For example, imagine you&#39;re a millionare who can&#39;t take time off. The value of you having money, which fulfills your ego, could be less than the value of having free time, enjoying your life, and living out your days. The best move would then be to quit and slowly spend your money while you&#39;re still alive.</p>\n<p>This presents interesting challenges in our lives. It can sometimes be a perplexing juggling act trying to figure out which scenario makes your life more valuable. What we know for sure is that making any attempt to make an informed choice is probably better than being completely ignorant, so just by keeping your values in mind, you&#39;ll probably get a very good outcome regardless.</p>\n","folder":4,"children":[{"path":"home/resources/money","name":"Money","parent":"home/resources","contents":"<p>I suspect most people have no idea what to do with money. I&#39;m not sure what to do with it, either, except spend it the best way you know how: through large, future-oriented investments.</p>\n<p>I imagine you don&#39;t need a lot of money to be happy, but depending on the type of environment you&#39;re in, you could need a lot of money to shape it into something that&#39;s a pleasure to live in. This could mean removing stressors, relocating, eating well, and having spare time.</p>\n","folder":0},{"path":"home/resources/nutrition","name":"Nutrition","parent":"home/resources","contents":"<p>I try to replace as much of my diet as is convenient with Huel, which is a powdered food replacement.</p>\n<table>\n<thead>\n<tr>\n<th>Nutritional attributes</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Flavour</td>\n<td>Huel Vanilla</td>\n</tr>\n<tr>\n<td>Calories per gram</td>\n<td>4kcal</td>\n</tr>\n<tr>\n<td>Calories per serving</td>\n<td>760kcal</td>\n</tr>\n<tr>\n<td>Calorie daily target</td>\n<td>3000kcal</td>\n</tr>\n</tbody>\n</table>\n<table>\n<thead>\n<tr>\n<th>Quantities</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>60g</td>\n<td>240kcal - 1/12</td>\n</tr>\n<tr>\n<td>90g</td>\n<td>360kcal - 1/8</td>\n</tr>\n<tr>\n<td>120g</td>\n<td>480kcal - 1/6</td>\n</tr>\n<tr>\n<td>150g</td>\n<td>600kcal - 1/5</td>\n</tr>\n<tr>\n<td>190g</td>\n<td>760kcal - 1/4</td>\n</tr>\n</tbody>\n</table>\n<p>Sometimes you can feel discomfort, which I think might be due to either:</p>\n<ul>\n<li>Too many calories per serving</li>\n<li>Too much Huel consumption</li>\n<li>Eating Huel and closely after eating normal food</li>\n</ul>\n<p>Powdered food offers a significant benefit on time savings and nutritional content. Huel usually accomodates for 50% of my calorie intake.</p>\n<h2 id=\"other-food\">Other Food</h2>\n<h3 id=\"sugar\">Sugar</h3>\n<blockquote>\n<p>Eating lots of sugar is the thing that makes me feel the worst and that I try hardest to avoid.  I also try to avoid foods that aggravate my digestion or spike up inflammation (for example, very spicy foods).  I don’t have much willpower when it comes to sweet things, so I mostly just try to keep junk food out of the house. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<p>I don&#39;t really enjoy sugary food, but if I have it around, I&#39;ll instintinctively grab more on autopilot. I almost always feel worse after I eat any volume of it. I think I should figure out how to get rid of it entirely, and replace it with snacks that are less intensely sugary.</p>\n<p>Sugary food is extremely widely available. If I were to cut it down by a meaningfully large percentage, the most likely solution would be to tackle my habits in getting food - shop at different places, or preprepare food, or pick snacks that aren&#39;t as sugary.</p>\n<h3 id=\"eating-for-pleasure\">Eating for Pleasure</h3>\n<p>By cutting down on the amount of meals I&#39;m forced to make, I can enjoy the meals I choose to make.</p>\n<p>I&#39;ve started eating more fruit, and significantly cut down on the meat I eat on average.</p>\n","folder":0},{"path":"home/resources/sleep","name":"Sleep","parent":"home/resources","contents":"<p>You know pretty quickly when you didn&#39;t sleep too well, and you&#39;ll know it for the rest of your day. That&#39;s why it&#39;s important to make sure you&#39;re getting both the time and quality you need.</p>\n<blockquote>\n<p>Sleep seems to be the most important physical factor in productivity - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<h2 id=\"quality\">Quality</h2>\n<p>On all days for the past few months, ten minutes to three hours have been eaten up by lying in bed or going straight back to sleep. I don&#39;t know why this happens.</p>\n<p>The best schedule which works right now is going to sleep somewhere between 2am and 4am. This is likely to move to a more reasonable time as I age.</p>\n<p>This works:</p>\n<blockquote>\n<p>I take a low dose of sleeping pills (like a third of a normal dose) or a very low dose of cannabis whenever I can’t sleep.  I am a bad sleeper in general, and a particularly bad sleeper when I travel.  It likely has tradeoffs, but so does not sleeping well. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n","folder":0},{"path":"home/resources/time","name":"Time","parent":"home/resources","contents":"<p>Lunchtime is the best time.</p>\n","folder":0}]},{"path":"home/blog","name":"Blog","parent":"home","order":1,"contents":"","folder":4,"children":[{"path":"home/blog/falseAndRealProgress","name":"False And Real Progress","parent":"home/blog","background":".png","order":3,"contents":"<p>I&#39;ve been experiencing a certain type of problem in my life recently. Simply put, it seems that our intuitions are not well primed to figure out if we&#39;re making high quality progress, and we can&#39;t rely on these intuitions especially as the tasks we&#39;re doing become more and more unclear.</p>\n<p>Understanding why is simple. It would make sense for our brains to care about the progress we&#39;re making so that we prioritize survival in a dangerous environment. But the tasks that help us survive have some unique characteristics: they are easily measurable and tracked, like herding cattle, lighting a fire, cooking food, or soothing a crying child.  Now, the difference between productivity and unproductivity is as slight as the difference between one series of keypresses and another series of keypresses. It&#39;s no wonder that our intuitions get it wrong.</p>\n<p>But the danger here is not that it&#39;s simply wrong, it&#39;s dangerously wrong. Over my first year in college, I thought that I ought to do project work and make my time in my course actually useful. A noble goal, but it was quickly forgotten about when it was replaced with a preoccupation to engage in the various intricacies of college work. To clarify, it is not that the work was hard: the first year was particularly easy and the workload very light. But the alarm bells that alert you to laziness did not sound, and so I did close to nothing with my free time. Looking back, it is startling how easy it is to not even consider if what you are doing is valuable, or to even shun any considerations out of your working conciousness. </p>\n<p>When I settled in to first year, I did what now seems like a whole lot of nothing. But it was comfortable - college work is clear, well defined, and has beautifully linear progression. You can pinpoint where you are in relation to the entire whole at any one time. You know that when you are clicking keys, stuff is getting done.</p>\n<p>Real life is considerably more tough. Nobody reminds you to get your work done. And most of all, there is no such linear visible progression. Continuing with the analogy of software projects, say you write a line of code - it is not at all clear whether you have just advanced by one task item or doomed yourself to a week of desperate bug fixing. Even worse, writing shitty code can cause effects down the line that are not visible the moment you write it, which skews the reward curve to a time scale that our primitive brains simply cannot intuitively grasp.</p>\n<p>We are used to carving a trinket out of wood, the progress of which is immediately visible, easily judged and somewhat clearly mapped. We are not used to working in today&#39;s world, where a single thought can leapfrog you years in advance, and the abscence of one can cause you to waste the precious time we have assigned to us.</p>\n<p>It&#39;s probably necessary to therefore implement a strict opinionated system of priorities. We cannot be relied on by our subconcious minds to tell us what to do anymore. And the first step, I would guess, would be constantly checking to see if what you are doing is about to push you into the future, or keep you in the past.</p>\n","folder":0},{"path":"home/blog/gettingBetterAtChoosingWhatToRead","name":"Getting Better At Choosing What To Read","parent":"home/blog","background":".png","order":1,"contents":"<p>In our lives, we consume content all the time. By content, I mean anything that&#39;s written, spoken, or shown. It&#39;s quite a no-brainer -- not many people exist that have never seen anything written or heard anything spoken -- but it gives us an interesting question. Can we, and should we, optimise the content we consume?</p>\n<p>First, some context. Humanity, for a long time, didn&#39;t have nearly as much information as we have access to now. Back in the primordial savannah, all you could get was stories from your tribe members about whatever current danger there was lurking about in the dark. If you were in a particularly advanced tribe, you could even pass on stories to your kids, forming a simple sort of culture where tales are passed on and knowledge is somewhat retained.</p>\n<p>Suffice to say, the situation has changed. It changed a lot when someone thought of a cool idea of a machine that writes books, and then it changed really sharply when someone thought of the Internet. I&#39;m not even going to bother throwing numbers at you that neither you nor I can even comprehend the scale of, but let&#39;s leave it at this: there is far more information now than there ever was.</p>\n<p>We are at the awkward teenager years of humanity where the rate at which we can consume information is super slow, and so, we have a desperate need for curation. And the real kicker is that since this is first time we&#39;ve experienced such a massive amount of information with such high availability, any intuitions about how to curate this information fall far short. </p>\n<h2 id=\"refining-curation\">Refining curation</h2>\n<p>Of course, to fix these problems fully would require radically reconstructing our brains. But even with our current limited hardware, I bet we can adapt.</p>\n<p>If we&#39;re looking for a personal advantage in curation, we can settle just for refining our personal methodologies. Since the world is somewhat competitive, and knowledge compounds like interest does, becoming slightly more effective at this task will yield large returns later on in life.</p>\n<p>How, in particular, we curate is a question that will determine much of our lives, and so is something that can&#39;t be totally addressed in a blog post. But I can give a first stab at an answer to this question that takes in a couple of assumptions. </p>\n<p>First, it assumes you&#39;re pretty early on in the learning process. You&#39;re still in education, or you just finished education, and you want a handle on the deep fundamentals more than you&#39;d want to grasp superficial technicalities. Depending on your world perspective, you could say you never really finish education, so this assumption could hold true forever.</p>\n<p>Second, it assumes that what you wanted to learn about does not change fast. This is correlated to how new the field is. This doesn&#39;t work at all for computer programming. It works slightly better but still pretty poorly for general computer science. If you get more broad, it works pretty well for mathematics. And for basic human behaviour, which did not change much over the past few millenia, it works perfectly. </p>\n<h3 id=\"1-consume-mostly-longform-content\">1. Consume mostly longform content</h3>\n<p>This means you should basically mostly read.</p>\n<p>Though the allure of bite-sized snippets of information is charming, the simple truth is that we need to engage with what we&#39;re reading in order to get anything at all out of it. It&#39;s not enough to read a book summary. Quite often, it&#39;s not even enough to read a book.</p>\n<p>Learning requires engagement and struggle. If what you&#39;re reading is easy, you&#39;re not improving. Durable knowledge is forged through frustrations, through feeling like you&#39;re stuck, and being regularly confused.</p>\n<h3 id=\"2-read-old-books\">2. Read old books</h3>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Lindy_effect\">Lindy effect</a> is the theory that if you see a book today, and it was written a long time ago, the chances are that it&#39;s quite good. A book survives proportional to it&#39;s value, where disappointing books die off quite quickly and great ones impact the culture for a long time. If a book exists today, and it is quite old, you can expect that it has some great ideas or stories that kept the book alive.</p>\n<h3 id=\"3-read-diversely\">3. Read diversely</h3>\n<p>Just like a good training routine gives you a few core movements that cover a wide range of muscles, you should read books that cover a wide range of topics, at least at the beginning. If you skip building a strong general foundation, you&#39;ll seem to progress faster but you&#39;ll stumble later on.</p>\n<p>This is especially true in a world which changes very fast. Being too specialized may seem productive, but just like a training routine which targets only one muscle, you&#39;ll die off whenever the world changes next, which will probably be sooner than you think. And at that point, your specialisation will be useless whenever the next big disruption plunges you into a world you don&#39;t even know the basics of.</p>\n","folder":0},{"path":"home/blog/theRoleAndPlaceOfClothes","name":"The Role And Place Of Clothes","parent":"home/blog","background":".png","order":3,"published":false,"contents":"<p>A lot of our lives revolves around optimisation. We want to optimise how many hours we work, or even how deeply we love one another.</p>\n<p>I approached clothes from the same front. We wear clothes every day, and so clearly refining the clothes I wear would have a large impact. On what? I do not quite know.</p>\n<p>What, indeed, do clothes impact? Well, they have a large role in first impressions. They probably play a part in perceived confidence or perceived social value. And that should be argument enough to declare clothes as important.</p>\n<p>But I think that is only an infinitesmal part of the story. First and foremost, our clothes are an extension of who we are. In <em>The Order of Time</em>, Carlo Rovelli comments that the way we perceive ourselves is through the mirror of how we believe others perceive us. We became so good at intuiting what other people are thinking, it became necessary to start seeing ourselves from their eyes, to guess what they felt about us, to guess how our tone of voice affects them, and to guess how our clothes made them feel. Our self image is a tapestry of different opinions and perspectives about who we are patched together.</p>\n<hr>\n<p>Imagine you were a new type of person who moved in to your local area from somewhere far away. To get to grips with this foregin land, you decide to take advice only if it is fully proven and studied. And so you would optimise your actions to give you the most reward with the smallest effort you can, so that your life is maximally good.</p>\n<p>This could seem like the ideal human being you should be. Rational, straightfoward, and it would cut out all of the superstitions and unfounded beliefs that we all carry deep in our self identity.</p>\n","folder":0},{"path":"home/blog/whatIsThisBlogFor","name":"What Is This Blog For","parent":"home/blog","background":".png","order":2,"contents":"<p>Now would probably be a good time to decide what this blog is about.</p>\n<p>I&#39;m planning on letting my curiosity dictate what I&#39;ll write about, and hope that later on I stumble on some concepts I find useful. I don&#39;t have enough experience in any one field to refine the scope of this blog, and I also don&#39;t want to kill my natural interest by trying to judge if a non-existant reader would theoretically enjoy my post. So this series of posts will be a little rambling.</p>\n<p>I&#39;m betting on the following:</p>\n<ul>\n<li>I won&#39;t want to write in this blog if I needed to optimize for metrics and I wasn&#39;t hitting them, making me feel demotivated</li>\n<li>It is improbable I will hit any metrics, nor would I really want to at this stage of my life</li>\n<li>Writing in this blog will make my writing and thoughts of higher quality</li>\n<li>This will pay off later in life</li>\n</ul>\n<p>This blog will probably <em>not</em> be representative of what I actually do, so you should Google me if that is the information you&#39;re looking for.</p>\n","folder":0}]},{"path":"home/philosophySeries","name":"Philosophy Series","parent":"home","contents":"<p>In terms of what I believe the most likely to be true, I am a:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Determinism\">Hard determinist</a>, meaning that free will is impossible and your choices are a result of some conbination of your nature and nurture</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Eliminative_materialism\">Eliminative materialist</a>, meaning that, in particular, consciousness does not exist, and the term will be eventually eliminated as neuroscience progresses <a href=\"http://consc.net/papers/nature.html\">1</a> <a href=\"http://consc.net/papers/moving.html\">2</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Absurdism\">Absurdist</a>, meaning that you must awknowledge that there is no meaning or purpose to our lives and universe, but despite this, our biology demands we pursue it and believe in it</li>\n</ul>\n","folder":4,"children":[{"path":"home/philosophySeries/meaning","name":"Meaning","parent":"home/philosophySeries","background":".jpg","contents":"<p>Melting Asphalt&#39;s <em><a href=\"https://meltingasphalt.com/a-nihilists-guide-to-meaning/\">A Nihilist&#39;s Guide To Meaning</a></em> is a good guide to what constitues a meaningful event.</p>\n<p>It proposes that since events cause each other, an event has higher <em>meaning</em> to us if the event is more of a bridging point: the event was crucial or else a lot of other events would not have happened. An event is less meaningful if it&#39;s a dead end - it didn&#39;t cause many events afterwards.</p>\n<p>This is an interesting perspective to view meaning through. If we want our lives to be more meaningful, it could mean that we need to become a part of the chain of events and start more things that would not have been started otherwise.</p>\n<h2 id=\"what-is-the-meaning-of-\">What is the meaning of...</h2>\n<h2 id=\"crisis-of-meaning\">Crisis of meaning</h2>\n<p>Upon reaching a ripe old age, many people experience some garden variety of existential crisis. They ask questions pertaining to the meaning of life, or the universe, or their work, and sometimes feel incredible sadness when they cannot find any.</p>\n<p>I argue that what it means to have meaning is not well defined in those kind of questions. Looking at a human being and asking - <em>&quot;What is it&#39;s meaning?&quot;</em> - yields the same results as looking at a pile of kindling and asking what it&#39;s meaning is. What <em>atually is</em> the meaning of kindling? Does the kindling have no meaning? Say a traveller gathers the pieces of kindling and adds them to her flame for warmth on a cold night. Is the meaning of the kindling to be burned? I argue it is not. The meaning of kindling is whatever we say it is - we assign it a meaning just like we assign things a value or a name.</p>\n<p>Asking an opaque question like &quot;what is the meaning of X&quot; implies meaning is some property of every object. I would assert that there is no such thing as meaning, and meaning cannot be measured, inquired as to, or compared, unless you&#39;re building a narrative, where you simply assign meaning as you see fit. The real world pays no attention to the need of humans for their lives to be organised into narratives, however, and so meaning is simply not applicable to reality. Many mistake the fact that there is no meaning at all with the idea that their lives are meaningless. Their lives would be meaningless only if some other person&#39;s life was meaningful - if there was some actual property of meaning floating around in space. In actuality, the idea of meaning is contradictory and bizzare, and the answer to &quot;what is my life&#39;s meaning&quot; is not available, and it is a mistake to be either upset or happy about that fact.</p>\n<p>At least in my sort of existential crises, I find that usually it&#39;s just usually a far simpler emotional issue present that I am accidentally ignoring, which sometimes manifest in sad philosophical musings. Since I realised that, I have far less concern with any sort of philosophy which pertains to our existence or meaning or lack thereof.</p>\n","folder":0},{"path":"home/philosophySeries/mistakes","name":"Mistakes","parent":"home/philosophySeries","background":".jpg","contents":"<h2 id=\"cultural-sentiment\">Cultural sentiment</h2>\n<p>Due to the structure of our social networks, mistakes have a more negative sentiment than was previously possible. This is for two reasons.</p>\n<p>For one, we consistently only see people&#39;s successes. In our social networks, people only want to share their successes in order to cast themselves in a better light. People&#39;s failiures are rarely shown as they are embarrased and make themselves appear less strong. This causes a negative loop where as people share less mistakes, people feel more implicitly bad about their mistakes, and less people share them.</p>\n<p>Another reason is that in our news culture, we see people grilled for mistakes all the time. Anger is one of the easiest emotions to spread, and so anger at our political representatives, our managers, employers, and people in general has reached a new high. If we are ever exposed to mistakes, we only see them in the worst possible light. If we didn&#39;t, the news wouldn&#39;t sell.</p>\n<h2 id=\"failiure-as-win\">Failiure as win</h2>\n<p>It&#39;s cliche to say that a mistake was a learning experience. But like all cliches, it&#39;s true, and the wisdom within this particular cliche proves to be very valuable.</p>\n<p>Consider this statement from a different perspective.</p>\n<p>Imagine a simple number game where you have to guess numbers within some bounds that you don&#39;t know. If your objective was to discover these bounds, it&#39;s a very bad sign indeed if you keep hitting a number within the bounds. And indeed, one wrong guess could tell you far more than ten right guesses.</p>\n<p>A mistake is just an event that we realize we could&#39;ve handled better. The realisation part is the win. If someone isn&#39;t self-reflective, they&#39;d have made no mistakes while clearly being worse off than someone who did record their events as mistakes.</p>\n","folder":0},{"path":"home/philosophySeries/mu","name":"Mu","parent":"home/philosophySeries","background":".jpg","contents":"<p>Mu, a Korean and Japanese term, is a word we do not have an adequate parallel for in the English language.</p>\n<p>It means &quot;no thing&quot;. For example, imagine a computer to have either ones or zeroes. You turn the computer off and ask does it contain a one or zero. The answer to the question is Mu.</p>\n<p>Mu is an answer which suggests that the question does not make sense to ask when considering reality. We are conditioned to think that every question has an answer, while offering Mu as a response signifies defeat. This is incorrect. It&#39;s vital to understand that not every question should be asked, and inherent in the question may be significant flaws.</p>\n<p>The closest parallel to Mu in English is <em>n/a</em>.</p>\n<p>Mu is used to indicate a question whose &quot;answer&quot; is to:</p>\n<ul>\n<li>un-ask the question,</li>\n<li>indicate the question is fundamentally flawed, or</li>\n<li>reject the premise that a <a href=\"https://en.wikipedia.org/wiki/Non-dual\">dualistic</a> answer can or will be given.</li>\n</ul>\n","folder":0},{"path":"home/philosophySeries/stoicisim","name":"Stoicisim","parent":"home/philosophySeries","background":".jpg","contents":"<p>Stoicisim is described as a life philosophy. In my mind, it amounts to a collection of time-tested values, methods, and advice that usually makes your life better.</p>\n<p>Like anything of non-negligible value, these techniques often take a few months to a few years to develop.</p>\n<h2 id=\"negative-visualisation\">Negative visualisation</h2>\n<p>Imagine deeply what your life would be like without something you currently posess - if you had lost it. Then, when you go back to reality, you&#39;re more likely to appreciate what you have and qualm your insatiable desires for more - desires which often unsettle and destroy people.</p>\n<h2 id=\"dichotomy-of-control\">Dichotomy of control</h2>\n<p>Understand what you can control and you can&#39;t. This saves you a lot of wasted time and effort.</p>\n<h2 id=\"determinisim\">Determinisim</h2>\n<p>Stoics believed in fatalism - literally, fate predetermined our past, future, and present.</p>\n<p>You can be fatalistic about your past and present, so that you don&#39;t get too worked up about circumstances that you cannot change. This is equivalent to being deterministic.</p>\n<p>Being fatalistic about your present, as we now know, is misguided.</p>\n<h2 id=\"self-denial\">Self-denial</h2>\n<p>Ocasionally deny yourself pleasures like good food or a comfortable existence so that you immunize yourself against a future where you could loose them for real. This reduces anxiety about any loss you could incur (since you could deal with it easier) and helps you combat the hedonic treadmill.</p>\n","folder":0}]},{"path":"home/emotionSeries","name":"Emotion Series","parent":"home","order":2,"contents":"<p>People consistently underestimate how much less competent they are when they are unhappy.</p>\n<p>Sam mentions a pattern which sometimes applies to me:</p>\n<blockquote>\n<p>Like most people, I sometimes go through periods of a week or two where I just have no motivation to do anything (I suspect it may have something to do with nutrition). This sucks and always seems to happen at inconvenient times. I have not figured out what to do about it besides wait for the fog to lift, and to trust that eventually it always does. And I generally try to avoid people and situations that put me in bad moods, which is good advice whether you care about productivity or not. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<p>I can&#39;t get the motivation and enthusiasm to do productive work on some days. This is usually solved by going outside or socializing more. It probably is also helped by taking small amounts of time off for leisure.</p>\n<h2 id=\"winter\">Winter</h2>\n<p>Ireland has the misfortune of being one of the countries with the least amount of sunlight hours.</p>\n<p>Sometimes, the lack of sunlight can be really demotivating. So far, what I&#39;ve found that works is keeping a journal with a list of sequential bullet-pointed tasks for your day, so that there is never any doubt about what&#39;s next. The smaller the tasks are the better.</p>\n","folder":9,"children":[{"path":"home/emotionSeries/regulation","name":"Regulation","parent":"home/emotionSeries","gradient":"linear-gradient(45deg, #ff9a9e 0%, #fad0c4 99%, #fad0c4 100%)","contents":"<p><em>Notes from <a href=\"https://www.youtube.com/watch?v=i7kh8pNRWOo\">Jonathan Blow&#39;s talk,</a></em> titled <em>Techniques for dealing with lack of motivation, malaise, depression.</em> This talk packaged ordinary mindfulness in a much more interesting way, and a lot of the points he hit resonated with what I learned from using Headspace and Calm.</p>\n<p>Jonathan describes our emotional state as comprised of three sections.</p>\n<h2 id=\"thoughts\">Thoughts</h2>\n<p>We think of ourselves as being composed of our thoughts, and we identify with them heavily. Instead of being so absorbed, we should instead aim to step back and allow them to pass.</p>\n<ol>\n<li>You are not your thoughts.</li>\n<li>It&#39;s very useful to stand back from your thoughts and just observe them happening.</li>\n</ol>\n<h2 id=\"sensations\">Sensations</h2>\n<p>If you&#39;re sitting down and think of the pressure between you and your chair, you think of a solid shape of equal pressure. But if you dig deeper, the shape is far less solid and the boundaries are not as sharp.</p>\n<ol>\n<li>Sensations are fundamentally netural. They are only information going into your brain.</li>\n<li>Your mind is engaged with amplyfing weak sensations, but you can see through this amplification when applying minimal effort.</li>\n</ol>\n<h2 id=\"emotion\">Emotion</h2>\n<p>You can descibe emotion as the way you see the colour of a room. Smallest emotions can spiral into something more difficult to manage.</p>\n<ol>\n<li>If you look at your emotional states, they dissapear.</li>\n<li>This can give you some relief when times are hard.</li>\n</ol>\n","folder":0},{"path":"home/emotionSeries/relationships","name":"Relationships","parent":"home/emotionSeries","gradient":"linear-gradient(to top, #a18cd1 0%, #fbc2eb 100%)","contents":"<p>In <a href=\"https://www.youtube.com/watch?v=DCS6t6NUAGQ\">Alain de Botton&#39;s talk,</a>Why You Will Marry The Wrong Person, Alain describes the following:</p>\n<p>Rage is just shattered hopes. And so if we are to get a little less angry and a little less sad about relationships, we have to diminish some of our hopes.</p>\n<p>Success is finding a person who&#39;s good enough, not someone who&#39;s perfect.</p>\n<p>In <a href=\"https://www.amazon.com/Thoughts-About-Relationships-Colin-Wright-ebook/dp/B00XCSPJ5S\">Some Thoughts about Relationships</a>, Colin Wright sets out a few dozen &#39;policies&#39; to set out terms for healthy relationships.</p>\n<h2 id=\"rationality-policy\">Rationality policy</h2>\n<p>The most important policy: awknowledge cause and effect, the possibility of iterative improvement, and the potential to solve problems.</p>\n<p>Being irrational tends more towards making up storylines, going through unnecessary struggle, and hoping that trying hard enough will get you to where you want to be.</p>\n","folder":0},{"path":"home/emotionSeries/control","name":"Control","parent":"home/emotionSeries","gradient":"linear-gradient(120deg, #a1c4fd 0%, #c2e9fb 100%)","contents":"<p>Since we were born, we immediately experienced emotions deeply and intensely. We often have no choice about what we&#39;re experiencing, even if we do try our best to make our life better.</p>\n<p>It&#39;s up to us to control these emotions, and make sure that they express themselves as a positive influence on our lives.</p>\n","folder":2},{"path":"home/emotionSeries/sexuality","name":"Sexuality","parent":"home/emotionSeries","gradient":"linear-gradient(120deg, #f6d365 0%, #fda085 100%)","contents":"<p>I am gay. To avoid succumbing to cultural bias and unproductive ways of thinking, I&#39;m trying to figure out more about what this means.</p>\n","folder":3}]},{"path":"home/work","name":"Work","parent":"home","contents":"","folder":4,"children":[{"path":"home/work/dyslexe","name":"Dyslexe","parent":"home/work","contents":"<p>Dyslex-E is a Chrome extension that adds a reader view to articles, which is built specifically for people with dyslexia.</p>\n<h2 id=\"technology\">Technology</h2>\n<p>Dyslexi runs on React, but it has to be compiled down to Javascript and executed as a Chrome extension.</p>\n<h2 id=\"purpose\">Purpose</h2>\n<p>The project was done voluntarily and pro-bono.</p>\n<p>Primarily, if people are helped by this extension, that would be a net gain to the world.  Also, I believe in the leadership behind the project, and seeing the project naturally gain momentum would be very satisfying and a great learning experience.</p>\n<h2 id=\"status\">Status</h2>\n<p>Started on 1st December 2018.</p>\n<p>Predicted end on February 2019.</p>\n","folder":0},{"path":"home/work/tutorello","name":"Tutorello","parent":"home/work","contents":"<p>Tutorello is an online platform for students to find one-on-one tutoring through video calls.</p>\n<p>I&#39;m working on Tutorello with Oisin O&#39;Dwyer for development, and the product is being built for the ExamLearn team.</p>\n<h2 id=\"technology\">Technology</h2>\n<p>Tutorello runs on Ruby on Rails, which we chose because of our large amount of experience with the framework. We also add an unconventional element by adding React.js in for the front-end framework.</p>\n<p>I imagine it is advisable to eventually switch to a more Javascript-based stack so that we can use React with something that has greater integration.</p>\n<h2 id=\"purpose\">Purpose</h2>\n<p>Although our purpose was mostly profit oriented, I hope that the platform does eventually make the lives of students around Ireland slightly easier.</p>\n<h2 id=\"reflection\">Reflection</h2>\n<p>Our work on Tutorello made us better engineers. Our planning on the architecture side of Tutorello helped building the application, but it might have been better if we had planned even more.</p>\n<p>The timing on the project was difficult to coordinate. Oisin and I had different schedules, and we took on responsibility for different ends of the project - Oisin was on the backend, and I was on the front end. This sounded like a reasonable split but it ended up that we couldn&#39;t fully build features on our own, having to always wait for the other side to ask for clarification and then build the correct functionality. Next time, we probably shouldn&#39;t do this.</p>\n<h2 id=\"status\">Status</h2>\n<p>Started on 30th July 2018.</p>\n<p>Predicted end on February 2019. </p>\n","folder":0},{"path":"home/work/directory","name":"Directory","parent":"home/work","contents":"<p>Directory is a collection of my values, thoughts, and ideas. It&#39;s a personal notebook that I use to get a better grasp on things I think are important.</p>\n<h2 id=\"technology\">Technology</h2>\n<p>Directory runs on React, but compiles down to Javascript and is served as static files on Github.</p>\n<h2 id=\"purpose\">Purpose</h2>\n<p>Thinking is hard. Directory aims to be a place for reflection on the past, and planning for the future. It&#39;s the dashboard and control center of my life.</p>\n<p>Directory is publicly visible because people taking interest in what I think is not an intrusion, but a great generosity. Not to mention that being public gives Directory more weight: unexpectedly, I&#39;m still contributing to it today.</p>\n","folder":1}]},{"path":"home/strategySeries","name":"Strategy Series","parent":"home","contents":"<p>Collection of plans, reviews, and reflections.</p>\n","folder":18,"children":[{"path":"home/strategySeries/2019Goals","name":"2019 Goals","parent":"home/strategySeries","contents":"<h1 id=\"1-explore\">1. Explore</h1>\n<p>I have a lot of freedom right now, which will be severely restricted in a few years. This year is the perfect time to spread myself wider and learn more about the world.</p>\n<h2 id=\"evaluation-metrics\">Evaluation metrics</h2>\n<p>The more new things you try, the better. Give far more value to the things you tried and failed, which indicates that you&#39;ve discovered a boundary, at least for now.</p>\n<h2 id=\"actionable-progress\">Actionable progress</h2>\n<p>Say no to less invitiations, unless you&#39;ve tried it before. Say no to more invitations where you could instead be doing something new. Allocate time for nothing and use it to wander.</p>\n<h1 id=\"2-connect\">2. Connect</h1>\n<p>Computer programming is a skill which nets highest gains when done in bursts of isolation. I have to counteract that by making a greater effort to foster deeper connection with others, and encourage growth in myself socially.</p>\n<h2 id=\"evaluation-metrics\">Evaluation metrics</h2>\n<p>The more emotional sense of connection, the better. Give little value to superficial connections like acquaintances. Give more value to people you know well.</p>\n<h2 id=\"actionable-progress\">Actionable progress</h2>\n<p>Make groups smaller. Go to college more, not for the lectures but for friends. Talk to those you don&#39;t know well. Be there for people.</p>\n<h1 id=\"3-prioritize\">3. Prioritize</h1>\n<p>The work you do when you&#39;re young compounds when you&#39;re older. Do less work that doesn&#39;t matter, and prioritize learning opportunities.</p>\n<h2 id=\"evaluation-metrics\">Evaluation metrics</h2>\n<p>Do more work that you&#39;re both interested in and seems important. Take up learning opportunities. Spend money.</p>\n<h2 id=\"actionable-progress\">Actionable progress</h2>\n<p>Invest heavily in yourself with both money and confidence. Get excited about the big picture and ignore the small stuff a little more.</p>\n","folder":0},{"path":"home/strategySeries/fourYearPlan","name":"Four Year Plan","parent":"home/strategySeries","contents":"<blockquote>\n<p>Summary: I&#39;m choosing to work on soft skills the most.</p>\n</blockquote>\n<p>I&#39;m not sure what I&#39;ll do in the long-term, but I know that I&#39;ll spend a large amount of my time working on something.</p>\n<h2 id=\"working-at-a-company\">Working at a company</h2>\n<p>Getting a regular job would have the potential to be fulfilling, stable, and fun, if I pick the right company to work in.</p>\n<blockquote>\n<p>How do you get hired at a company? Is there anything I can do to prepare myself early?</p>\n</blockquote>\n<h3 id=\"smaller-organisations\">Smaller organisations</h3>\n<p>If I work in a smaller organisation, like a startup, or a collective, or a service-based startup, I&#39;d be responsible for more and grow faster.</p>\n<blockquote>\n<p>What is the difference between startup hiring process and the process of bigger companies?</p>\n</blockquote>\n<h3 id=\"freelancing\">Freelancing</h3>\n<p>Working solo outside of a company is not likely to be fulfilling due to the lack of social and emotional connection with other people.</p>\n<p>If I do decide to freelance, it&#39;d probably be because the opportunities are higher than I&#39;m currently imagining, and that I can form a team around it.</p>\n<h2 id=\"areas-of-growth-for-careers\">Areas of growth for careers</h2>\n<p>No matter where I end up working, or who I end up working with, it&#39;ll still be all work. All of this work comes with a common skillset.</p>\n<p>They&#39;re usually called soft skills, but this name undermines their importance, especially when communication, critical thinking, and leadership fall under the <a href=\"https://www.thebalancecareers.com/list-of-soft-skills-2063770\">definition of a soft skill</a>.</p>\n<p>These skills are important - more important than hard skills like programming. This is because of the two categories have vastly different costs assosciated with learning them.</p>\n<p>With hard skills, you could pick up a book and eventually move on to cheap practice that can be done entirely on your laptop. On the other hand, soft skills involve real-world experience, time, and wisdom; which involves an expensive sort of practicing where you are forged into a different person. This is hard to do, and takes quite a bit of time.</p>\n<p>It&#39;s clear that our computers are nothing more than a layer of abstraction upon our values. Every device and program is built wholly by people, for people, and through people&#39;s thoughts, beliefs, and values.</p>\n<p>Therefore, it makes sense to learn about people first, and computers second. </p>\n<h2 id=\"areas-of-growth-for-life\">Areas of growth for life</h2>\n<p>It&#39;s no coincidence that the soft skills companies require also make a large impact on your own life.</p>\n<p>A job pays for your time in some sense - but most importantly, they&#39;re paying for your prescence to be in a room with other people and make progress on issues and tasks that the company cares about. The skills you need to make progress in careers translate to many of the same skills you need to make progress in life.</p>\n<h2 id=\"achieving-growth\">Achieving growth</h2>\n<p>Soft skills are not easy to teach.</p>\n<p>You don&#39;t go about learning hard skills, since <em>hard skills</em> is vague and includes the skills used in every field of human endeavour. Similarly, the term &#39;soft skills&#39; encompasses a range of talents that would take many human lifetimes to fully develop. </p>\n<p>It appears that soft skills are learned through consistent long-term exposure to working environments and good people.</p>\n<p>The list of soft skills is so large that it&#39;s not useful to list them. They range in topics from communication, critical thinking, leadership, and work ethic, including others. I probably don&#39;t have a good view of which skills are the most valuable ones.</p>\n","folder":0},{"path":"home/strategySeries/takingAction","name":"Taking Action","parent":"home/strategySeries","contents":"<p>While we normally take action in order to make our lives better, it could be more useful to take action based on <em>salience</em>.</p>\n<p>Salience is the quality of standing out - in plain terms, it means interesting. Prioritising on salience is far more likely to allow you to learn quickly and avoid unproductive dead-ends (local maximums).</p>\n<p>Leading a more interesting life would yield more long-term gains. </p>\n","folder":0},{"path":"home/strategySeries/risks","name":"Risks","parent":"home/strategySeries","contents":"<p>An evolving document on the important long-term risks I face.</p>\n<h2 id=\"risk-management\">Risk management</h2>\n<p>While we are on high alert for a quick loss, we can&#39;t grasp or seem to care about losses that may accumulate over long-term periods of time. Each individual loss is invisible, and so we aren&#39;t aware of it chipping away at our life until we look back at the end of it and realize we have suffered greatly.</p>\n<p>A balanced approach to risk would therefore need to consider long-term risks, which can often be far more dangerous.</p>\n","folder":4},{"path":"home/strategySeries/reviews","name":"Reviews","parent":"home/strategySeries","contents":"<p>Reviews of the things I&#39;m doing, to see what needs to change.</p>\n","folder":9}]}]}}
