{"path":"home/resources/health/sleep","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/resources/health/sleep","name":"Sleep","parent":"home/resources/health","contents":"<p>You know pretty quickly when you didn&#39;t sleep too well, and you&#39;ll know it for the rest of your day. That&#39;s why it&#39;s important to make sure you&#39;re getting both the time and quality you need.</p>\n<blockquote>\n<p>Sleep seems to be the most important physical factor in productivity - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n<h2 id=\"quality\">Quality</h2>\n<p>I&#39;m sensitive to caffeine, even in tea, which used to be my favourite way to end an evening.  The difference cutting out tea makes is big. I&#39;ll get some decaf tea to be able to start that habit again.</p>\n<p>On all days for the past few months, ten minutes to three hours have been eaten up by lying in bed or going straight back to sleep. I think this is a hormone thing, where teenagers aren&#39;t supposed to wake up at 8am. </p>\n<p>Another factor could be that it&#39;s an issue with the winter season, caused by the lack of light and exposure to the outdoors. I need to start using the LED light more consistently. </p>\n<p>The time I go to sleep tends to drift in ten minute increments until I force it to move backwards again. This points further towards the hormone theory, where my body is trying to adjust.</p>\n<p>The best schedule which works right now is going to sleep somewhere between 2am and 4am.</p>\n<p>This could work:</p>\n<blockquote>\n<p>This is likely to be controversial, but I take a low dose of sleeping pills (like a third of a normal dose) or a very low dose of cannabis whenever I can’t sleep.  I am a bad sleeper in general, and a particularly bad sleeper when I travel.  It likely has tradeoffs, but so does not sleeping well. - <a href=\"http://blog.samaltman.com/productivity\">Productivity, Sam Altman</a></p>\n</blockquote>\n","folder":0},"children_notes":[]}}
