{"path":"home/plans/2018Goals","templateID":2,"sharedPropsHashes":{},"localProps":{"note":{"path":"home/plans/2018Goals","name":"2018 Goals","parent":"home/plans","contents":"<h1 id=\"1-explore\">1. Explore</h1>\n<p>I have a lot of freedom right now, which will be severely restricted in a few years. This year is the perfect time to spread myself wider and learn more about the world.</p>\n<h2 id=\"evaluation-metrics\">Evaluation metrics</h2>\n<p>The more new things you try, the better. Give far more value to the things you tried and failed, which indicates that you&#39;ve discovered a boundary, at least for now.</p>\n<h2 id=\"actionable-progress\">Actionable progress</h2>\n<p>Say no to less invitiations, unless you&#39;ve tried it before. Say no to more invitations where you could instead be doing something new. Allocate time for nothing and use it to wander.</p>\n<h1 id=\"2-connect\">2. Connect</h1>\n<p>Computer programming is a skill which nets highest gains when done in bursts of isolation. I have to counteract that by making a greater effort to foster deeper connection with others, and encourage growth in myself socially.</p>\n<h2 id=\"evaluation-metrics\">Evaluation metrics</h2>\n<p>The more emotional sense of connection, the better. Give little value to superficial connections like acquaintances. Give more value to people you know well.</p>\n<h2 id=\"actionable-progress\">Actionable progress</h2>\n<p>Make groups smaller. Go to college more, not for the lectures but for friends. Talk to those you don&#39;t know well. Be there for people.</p>\n<h1 id=\"3-prioritize\">3. Prioritize</h1>\n<p>The work you do when you&#39;re young compounds when you&#39;re older. Do less work that doesn&#39;t matter, and prioritize learning opportunities.</p>\n<h2 id=\"evaluation-metrics\">Evaluation metrics</h2>\n<p>Do more work that you&#39;re both interested in and seems important. Take up learning opportunities. Spend money.</p>\n<h2 id=\"actionable-progress\">Actionable progress</h2>\n<p>Invest heavily in yourself with both money and confidence. Get excited about the big picture and ignore the small stuff a little more.</p>\n","folder":0},"children_notes":[]}}
